[
  {
    "name": "Granite",
    "description": "Granite is a coarse-grained igneous rock that is composed mainly of quartz, feldspar, and mica minerals. It typically has a granular texture and is known for its durability and strength. Granite forms deep within the Earth's crust through the slow cooling and solidification of molten magma. It is abundant in continental crust and can be found in various colors, including gray, pink, white, and black. Granite is commonly used as a construction material due to its strength and resistance to weathering and erosion. It is often quarried and cut into slabs for use as countertops, flooring, and building facades. Granite is also used for decorative purposes, such as in monuments and sculptures. Its unique combination of beauty, durability, and versatility has made it a popular choice in architecture and design. Granite is considered one of the most common and widely distributed rocks on Earth.",
    "wikiImage": "https://www.geologypage.com/wp-content/uploads/2019/05/Granite-Rocks-GeologyPage.jpg"
  },
  {
    "name": "Basalt",
    "description": "Basalt is a dark-colored, fine-grained igneous rock that is formed from the rapid cooling of lava at or near the Earth's surface. It is composed primarily of minerals such as pyroxene, plagioclase feldspar, and olivine. Basalt is known for its dense and durable nature, making it a common rock type in volcanic regions and oceanic crust. Its color ranges from dark gray to black. Basaltic lava flows can create extensive volcanic landscapes known as basalt plateaus or flood basalts. Basalt rock is commonly used in construction for its strength and resistance to weathering. It is used in the production of crushed stone, concrete aggregates, and asphalt for road construction. Basalt is also utilized in making statues, sculptures, and jewelry due to its aesthetic appeal. Basalt is found in many regions around the world, including volcanic areas and areas of recent volcanic activity.",
    "wikiImage": "https://lh3.googleusercontent.com/-QEomL5SCA88/UI_BYmrHC_I/AAAAAAAAIJI/sKrApW_pWlEAeB1BLvlqhLWj018HjGptgCHM/s512/Scoria-from-Etna.jpg"
  },
  {
    "name": "Limestone",
    "description": "Limestone is a sedimentary rock primarily composed of calcium carbonate (CaCO3) in the form of mineral calcite. It forms from the accumulation of shells, coral, algae, and other organic materials over millions of years. Limestone often has a light color, ranging from white to gray, but can also exhibit various shades of yellow, brown, and even blue. It has a relatively soft texture and can be easily scratched with a fingernail. Limestone is commonly used as a building material and for various applications such as cement production, road construction, and as a component in the manufacturing of glass and ceramics. It also serves as an important geological resource and contains valuable fossils and geological information about Earth's history",
    "wikiImage": "https://m.media-amazon.com/images/I/81+hxSmlXtL.jpg"
  },
  {
    "name": "Sandstone",
    "description": "Sandstone is a sedimentary rock composed mainly of sand-sized mineral particles or rock fragments. It forms through the accumulation and cementation of sand grains over time. The grains are typically composed of quartz, feldspar, and other minerals. Sandstone is characterized by its coarse texture and visible grains, which give it a gritty feel. It comes in a variety of colors, including tan, brown, red, and yellow, depending on the composition of the sand grains and the presence of other minerals. Sandstone is a durable and versatile rock, widely used in construction and architecture. It is commonly used as a building material for walls, facades, and pavements. Sandstone is also employed in the production of glass, ceramics, and concrete. Due to its porous nature, sandstone can be used as a reservoir rock for storing oil, gas, and groundwater. It is often seen in natural landmarks such as cliffs, canyons, and rock formations, and it serves as a habitat for various organisms. Sandstone is found in many parts of the world, with notable formations in places like the American Southwest, the Australian Outback, and the Sahara Desert.",
    "wikiImage": "https://mineralseducationcoalition.org/wp-content/uploads/Sandstone2_56061193.jpg"
  },
  {
    "name": "Slate",
    "description": "Slate is a fine-grained metamorphic rock that forms from the compaction of clay, mud, or shale. It is characterized by its smooth texture, low porosity, and ability to split into thin, flat sheets. Slate typically exhibits a dark gray or black color, although it can also occur in shades of green, red, or purple, depending on the presence of different minerals. The rock is formed under intense heat and pressure, which causes the clay minerals to recrystallize and align, resulting in the characteristic foliation or cleavage planes of slate. Due to its ability to split easily along these planes, slate has been widely used as a roofing material, flooring, and for making decorative items such as slate tiles and chalkboards. It is a highly durable and water-resistant rock, making it suitable for outdoor applications. Slate is also valued for its aesthetic appeal and is often used in interior design to create a rustic or natural look. The rock can be found in various regions around the world, including Wales, Spain, Brazil, and the United States.",
    "wikiImage": "https://m.media-amazon.com/images/I/81DqWINkngL._AC_UF894,1000_QL80_.jpg"
  },
  {
    "name": "Diorite",
    "description": "Diorite is a coarse-grained igneous rock that is composed primarily of plagioclase feldspar, biotite, hornblende, and/or pyroxene minerals. It is known for its intermediate composition between granite and gabbro, exhibiting a balance of light and dark minerals. Diorite typically appears gray to dark gray in color, although variations with green or brown hues can also occur. The rock is formed through the slow cooling and solidification of magma deep within the Earth's crust. Diorite's texture is generally coarse, with visible crystals that give it a granular appearance. It often displays a speckled or salt-and-pepper texture due to the contrasting colors of its constituent minerals. Diorite is a durable and hard rock, making it suitable for various construction purposes. It has been used as a building material for centuries, employed in the construction of walls, floors, countertops, and monuments. Its strength and resistance to weathering make it a popular choice for outdoor applications. Diorite can be found in various regions worldwide, including parts of North America, Europe, Asia, and Africa.",
    "wikiImage": "https://rockhoundresource.com/wp-content/uploads/2022/09/Diorite-2-1024x788.jpg"
  },
  {
    "name": "Gabbro",
    "description": "Gabbro is a coarse-grained igneous rock composed mainly of plagioclase feldspar and pyroxene minerals. It is formed deep within the Earth's crust through the slow cooling and solidification of magma. Gabbro typically exhibits a dark color, ranging from dark gray to black, with a speckled or mottled appearance. Its texture is coarse and granular, characterized by visible crystals that give it a distinctive look. Known for its durability and strength, gabbro is commonly used in construction and architectural applications. It is frequently utilized as a dimension stone for countertops, flooring, and wall cladding due to its attractive appearance and resistance to wear and weathering. Gabbro's toughness and high compressive strength make it suitable for heavy-duty applications such as curbstones, paving stones, and building foundations. It is also used as crushed stone in road construction, railroad ballast, and aggregate for concrete. Gabbro is found in various parts of the world, with notable occurrences in regions with volcanic activity, including Norway, Scotland, the United States, and Canada.",
    "wikiImage": "https://i0.wp.com/geologyscience.com/wp-content/uploads/2018/04/01317-gabbro-10-cm.jpg?fit=750%2C560&ssl=1"
  },
  {
    "name": "Obsidian",
    "description": "Obsidian is a natural volcanic glass formed when molten lava cools rapidly without crystallization. It is characterized by its smooth, glassy texture and typically has a dark color, ranging from black to various shades of brown and green. Obsidian is primarily composed of silica, and its lack of crystalline structure gives it a unique appearance. It has been used by humans for thousands of years for various purposes, including tools, weapons, and decorative objects. Due to its sharp edges and ability to be flaked into thin, sharp blades, obsidian was extensively used by early humans for making arrowheads, knives, and other cutting tools. Today, it is still used in some surgical scalpels and blades. Obsidian is also highly valued as a gemstone due to its striking appearance. It is often used in jewelry and ornamental objects, such as pendants, beads, and sculptures. This volcanic glass can be found in volcanic areas around the world, with significant deposits in regions with past or present volcanic activity, including the western United States, Mexico, Japan, Italy, and Ethiopia.",
    "wikiImage": "https://2.bp.blogspot.com/-Zpns9AKQHnM/WIDiK2hlb6I/AAAAAAAAEcs/xZzzIPdbRicita-lyCymyKsjnXwuO5i5ACLcB/s1600/00588%2BIMG_8210%2B11%2Bcm%2Bobsidian%2BDzaraber%2BArmenia.jpg"
  },
  {
    "name": "Pumice",
    "description": "Pumice is a type of volcanic rock that forms when lava with high water and gas content erupts from a volcano. It is characterized by its frothy texture and extremely low density. Pumice is so light that it can float on water. It is typically light gray or white in color and has a porous and spongy appearance due to the presence of numerous gas bubbles trapped within the rock during its formation. The frothy texture of pumice is a result of rapid cooling and solidification of the lava, which allows the gas bubbles to remain intact. Pumice is widely used for its abrasive properties and is often used in cleaning and polishing applications. It is also used as a lightweight aggregate in construction materials, such as concrete and plaster, to reduce the overall weight of the structures. Additionally, pumice is utilized in horticulture as a soil amendment to improve drainage and aeration. The largest deposits of pumice are found in volcanic regions around the world, including areas like Italy, Greece, the United States, and New Zealand.",
    "wikiImage": "https://www.thoughtco.com/thmb/CWjU63WP5fRWbUbehw_M8Cph9ZA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/pumice-stone-detail-isolated-on-white-119398150-5c7be1f2c9e77c00011c839e.jpg"
  },
  {
    "name": "Rhyolite",
    "description": "Rhyolite is a fine-grained volcanic rock that is chemically similar to granite. It is formed from the rapid cooling and solidification of lava at or near the Earth's surface. Rhyolite typically has a light-colored appearance, ranging from pale gray to pink or reddish-brown. It is composed mainly of quartz, feldspar, and small amounts of other minerals such as mica and amphibole. The texture of rhyolite can vary, but it is generally porphyritic, meaning it contains larger crystals (phenocrysts) embedded in a finer-grained matrix. These phenocrysts are typically feldspar minerals. Rhyolite is known for its high silica content, which gives it a relatively low melting point compared to other volcanic rocks. It is commonly found in volcanic areas and can occur as lava flows, volcanic ash deposits, or as intrusive bodies such as dikes and sills. Rhyolite has been used as a building material and for decorative purposes throughout history. Its fine-grained texture and variety of colors make it suitable for architectural applications, as well as for making jewelry and ornamental objects.",
    "wikiImage": "https://m.media-amazon.com/images/I/71q1BnrzgfL.jpg"
  },
  {
    "name": "Andesite",
    "description": "Andesite is a volcanic rock that is commonly found in volcanic arcs and mountain ranges. It is formed from the solidification of lava or magma that is intermediate in composition between basalt and rhyolite. Andesite typically has a gray to dark gray color and a fine-grained texture. It is composed primarily of plagioclase feldspar and volcanic glass, with smaller amounts of other minerals such as amphibole, pyroxene, and biotite. The presence of plagioclase feldspar gives andesite its characteristic light-colored appearance. Andesite is known for its intermediate silica content, which contributes to its moderate viscosity and eruption style. It can form as lava flows, volcanic domes, and volcaniclastic deposits. Andesite is commonly associated with explosive volcanic activity and can be found in regions of volcanic activity such as subduction zones and volcanic arcs. It is widely used as a construction material due to its durability and strength. Its fine-grained texture makes it suitable for various applications, including road construction, building stones, and aggregate for concrete.",
    "wikiImage": "https://mineralseducationcoalition.org/wp-content/uploads/andesite_366069737.jpg"
  },
  {
    "name": "Pegmatite",
    "description": "Pegmatite is an igneous rock that forms in the final stages of magma cooling, characterized by its exceptionally large crystal size. It often occurs in dikes or veins within other rocks. Pegmatite crystals can range in size from a few centimeters to several meters, making them significantly larger than the crystals found in typical igneous rocks. The composition of pegmatite varies widely, but it commonly contains minerals such as quartz, feldspar, mica, and various gemstones. Due to its unique mineral composition and large crystal size, pegmatite is a valuable source of rare and precious minerals. It is particularly sought after for gemstone production, as well as for obtaining economically significant minerals like lithium, tantalum, and beryllium. The formation of pegmatite is often associated with the presence of granitic intrusions and hydrothermal processes. Its distinctive texture and mineral diversity make it a fascinating rock for geological study and a prized resource for both industrial and aesthetic purposes.",
    "wikiImage": "https://www.alexstrekeisen.it/immagini/diagrammi/pegmatite2019(4).jpg"
  },
  {
    "name": "Peridotite",
    "description": "Peridotite is a coarse-grained ultramafic rock that is primarily composed of the mineral olivine. It is one of the main rock types found in the Earth's mantle. Peridotite has a dark green to brownish-green color and a granular texture. It is rich in iron and magnesium, giving it a high density and low silica content. The presence of olivine gives peridotite its characteristic color and a distinctive grainy appearance. Peridotite is commonly found in areas where the Earth's mantle has been exposed, such as in ophiolites and some mountain ranges. It is also the source rock for many types of igneous rocks, including basalt and komatiite. Peridotite is known for its high melting point, making it resistant to weathering and erosion. It is often found in the form of large intrusive bodies known as massifs or as xenoliths within other igneous rocks. Peridotite is also the main source of the gemstone peridot, which is a variety of olivine.",
    "wikiImage": "https://m.media-amazon.com/images/I/81DL6+Ft6HL.jpg"
  },
  {
    "name": "Scoria",
    "description": "Scoria is a dark-colored extrusive igneous rock that is commonly found in volcanic environments. It is formed from frothy lava that is ejected during volcanic eruptions and rapidly cools and solidifies in the air. Scoria has a vesicular texture, which means it contains numerous small holes or vesicles created by trapped gas bubbles. These vesicles give the rock a porous and lightweight nature. Scoria is typically black or dark brown in color, although it can also range from reddish-brown to purple. It has a rough, jagged surface and is often characterized by its frothy appearance. Due to its porosity, scoria is known for its ability to retain moisture and is often used as a lightweight aggregate in construction and horticulture. Scoria is commonly found in volcanic regions and can be associated with basaltic or andesitic lava flows. It is frequently used in landscaping, as decorative rock, and as a component in the production of lightweight concrete. The vesicles in scoria can be filled with secondary minerals such as quartz, calcite, or zeolites, adding to its aesthetic appeal.",
    "wikiImage": "https://upload.wikimedia.org/wikipedia/commons/1/18/Scoria_Macro_Digon3.jpg"
  },
  {
    "name": "Tuff",
    "description": "Tuff is a type of rock formed from the consolidation of volcanic ash and other volcanic materials. It is created when volcanic eruptions eject ash and pyroclastic debris into the air, which then settles and accumulates on the ground. Over time, the loose volcanic fragments become compacted and cemented together, forming a solid rock. Tuff typically has a porous and lightweight structure due to the presence of air-filled voids. It can vary in color, ranging from light to dark, depending on the composition of the volcanic materials. Tuff is commonly used as a building material, especially in areas with volcanic activity, and it is also valued for its aesthetic appeal in landscaping and architecture.",
    "wikiImage": "https://m.media-amazon.com/images/I/81mjIwNmouL.jpg"
  },
  {
    "name": "Shale",
    "description": "Shale is a fine-grained sedimentary rock composed primarily of clay minerals. It is formed through the compaction and cementation of tiny particles of clay, silt, and other organic materials. Shale is characterized by its finely layered structure, which is a result of the gradual deposition of sediment over long periods of time. The rock typically has a dull appearance and can vary in color, ranging from gray and black to brown and red. Shale is known for its ability to split into thin, flat sheets, making it easily breakable along its bedding planes. It has a smooth, compact texture and is often used as a building material in the form of bricks and tiles. Shale is also an important source rock for natural gas and petroleum, as it has the ability to trap and store hydrocarbons within its porous layers. Due to its high clay content, shale has low permeability and is impermeable to water, making it an effective barrier for groundwater and oil and gas reservoirs. Shale deposits can be found in various locations around the world and are often associated with other sedimentary rocks such as sandstone and limestone.",
    "wikiImage": "https://www.sandatlas.org/wp-content/uploads/1709-09.08.15_4-phyllite-Friarfjord-27-cm.jpg"
  },
  {
    "name": "Conglomerate",
    "description": "Conglomerate is a type of sedimentary rock characterized by its coarse-grained nature and rounded rock fragments, known as clasts, that are cemented together. It is formed through the accumulation and lithification of gravel-sized particles, which can range from pebbles to boulders. The clasts in conglomerate can be composed of various rock types, including quartz, limestone, granite, and others, giving the rock a diverse appearance. The clasts are typically well-rounded and smoothed due to the transportation and erosion processes they have undergone before deposition. Conglomerate often exhibits a noticeable size grading, with larger clasts at the bottom and smaller ones toward the top, reflecting the sorting action of flowing water or other transporting agents. The matrix, which fills the spaces between the clasts, can consist of sand, silt, clay, or a combination of these materials. Conglomerate is commonly found in fluvial environments, such as riverbeds and alluvial fans, as well as in coastal areas and ancient delta deposits. It is often used as a construction material due to its durability and resistance to weathering. In some cases, conglomerate deposits can contain valuable minerals or fossil specimens.",
    "wikiImage": "https://mineralseducationcoalition.org/wp-content/uploads/Conglomerate2_stone_160479908.jpg"
  },
  {
    "name": "Breccia",
    "description": "Breccia is a type of sedimentary rock characterized by its coarse-grained texture and angular rock fragments, known as clasts, that are cemented together. It forms when broken fragments of pre-existing rocks, such as granite, limestone, or shale, are compacted and cemented. The clasts in breccia are typically larger and more angular compared to those in conglomerate, giving the rock a fragmented appearance. The angular nature of the clasts suggests that they have not undergone extensive transportation and rounding. The matrix, which fills the spaces between the clasts, can consist of various materials, including sand, silt, clay, or even other smaller rock fragments. Breccia can exhibit a wide range of colors, depending on the composition of the clasts and the cementing materials. It is commonly found in fault zones, where the rocks have been shattered and broken during tectonic activity. It can also form in other environments, such as landslides or volcanic eruptions, where rocks are fragmented and rapidly deposited. Breccia is often used as a decorative stone in construction and landscaping due to its unique texture and aesthetic appeal. In addition, it can serve as a valuable geological indicator, providing insights into past geological processes and events.",
    "wikiImage": "https://www.thoughtco.com/thmb/_vbQp2qGK0sRD_vZxuAJpiemozY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/sample-of-breccia-152543399-5b0aeefca474be003708160e.jpg"
  },
  {
    "name": "Chalk",
    "description": "Chalk is a soft, fine-grained sedimentary rock composed primarily of calcite, a form of calcium carbonate. It is typically white or light gray in color and has a powdery texture that can easily be scratched or marked. Chalk forms from the accumulation of microscopic marine organisms, such as foraminifera and coccoliths, over millions of years. It is commonly found in large deposits in areas that were once covered by ancient seas. Chalk has been widely used throughout history for various purposes, including writing, drawing, and as a building material. It is famously associated with chalkboards and sidewalk chalk. Due to its porous nature, chalk is also used as a filter in water treatment and in manufacturing cement. Its softness and ease of erasure make it a versatile tool for artistic expression and educational purposes. However, chalk is relatively brittle and can be easily weathered or eroded over time.",
    "wikiImage": "https://m.media-amazon.com/images/I/81+hxSmlXtL.jpg"
  },
  {
    "name": "Coal",
    "description": "Coal is a combustible sedimentary rock formed from the remains of ancient plants that lived millions of years ago. It is primarily composed of carbon, along with varying amounts of other elements such as hydrogen, sulfur, and oxygen. Coal comes in several different types, including anthracite, bituminous, sub-bituminous, and lignite, each with varying carbon content and energy value. It is typically black or brown in color and has a layered or stratified appearance. Coal has been a significant source of energy for centuries, used extensively for electricity generation, industrial processes, and heating. The mining of coal has both economic benefits and environmental implications, as it can result in habitat destruction, water pollution, and greenhouse gas emissions. Efforts to transition to cleaner and more sustainable energy sources have led to a decrease in coal consumption in some regions. However, coal continues to be a crucial energy resource in many parts of the world, contributing to global energy production and economic development.",
    "wikiImage": "https://d12oja0ew7x0i8.cloudfront.net/images/news/ImageForNews_60070_16639360696318441.jpg"
  },
  {
    "name": "Dolomite",
    "description": "Dolomite is a sedimentary rock composed primarily of calcium magnesium carbonate. It is often found in massive formations and can range in color from white to gray, pink, or even brown. Dolomite forms through the chemical alteration of limestone or lime mud in the presence of magnesium-rich groundwater. It is known for its distinctive rhombohedral crystal shape and can display a pearly or glassy luster. Dolomite is widely used in construction and industrial applications due to its hardness, durability, and resistance to weathering. It is commonly used as a crushed stone for road base, concrete aggregates, and as a flux in iron and steel production. In addition, dolomite is valued for its ornamental purposes, being carved into sculptures, countertops, and other decorative items. Some dolomite formations also contain significant mineral deposits, such as magnesium, which are of economic importance. With its unique composition and versatile applications, dolomite plays a crucial role in various industries and adds aesthetic appeal to architectural designs.",
    "wikiImage": "https://3.bp.blogspot.com/-qaVdJE00m08/WH9z6TFoY6I/AAAAAAAAEYo/6TopxiuCZSAsJigQ7skyw0nh4fhC2yYhgCLcB/s1600/1750%2B13.08.15_3%2Bdolomite%2Bmarble%2B14%2Bcm.jpg"
  },
  {
    "name": "Flint",
    "description": "Flint is a hard, sedimentary rock composed primarily of silica. It is typically gray, black, or brown in color and has a glassy or waxy appearance. Flint forms through the deposition of microscopic silica-rich organisms in ancient marine environments. It is known for its exceptional hardness and ability to produce sparks when struck against steel, making it valuable for toolmaking and fire starting. Flint has been used by humans for thousands of years, from crafting primitive weapons and tools to creating fire by striking it against a piece of steel or iron. It is also widely recognized for its use in the production of flintlock firearms and as a material for creating sharp-edged cutting tools. The presence of flint in archaeological sites often indicates evidence of human activity and tool manufacturing. Due to its durability and fire-making properties, flint continues to have practical and historical significance in various fields, including archaeology, craftsmanship, and outdoor survival.q",
    "wikiImage": "https://m.media-amazon.com/images/I/61+Fsc-yn-L._AC_UF1000,1000_QL80_.jpg"
  },
  {
    "name": "Gypsum",
    "description": "Gypsum is a soft sulfate mineral that is composed of calcium sulfate dihydrate. It typically forms as an evaporite mineral, meaning it is deposited from water solutions that have become concentrated through the evaporation of water. Gypsum has a white to gray color and a silky or glassy appearance. It is known for its characteristic property of easily being scratched by a fingernail. Gypsum is widely used in various industries, including construction, as it is a major component in the production of plaster, drywall, and cement. It is also used in agriculture as a soil conditioner and in the manufacturing of fertilizers. Additionally, gypsum has some uses in the field of art and decoration, where it is employed in sculptures, molds, and ornamental designs.",
    "wikiImage": "https://assets.fishersci.com/TFS-Assets/CCG/Eisco/product-images/S41485.jpg-650.jpg"
  },
  {
    "name": "Lignite",
    "description": "Lignite is a type of coal that is considered the lowest rank of coal due to its relatively low carbon content and energy density. It is a soft, brownish-black sedimentary rock that forms from the compression of peat over millions of years. Lignite contains a high amount of moisture and volatile matter, which makes it less energy-dense compared to other types of coal. It is primarily composed of carbonized plant material, such as wood and peat, and it often exhibits a woody texture and fibrous structure. Lignite is commonly used as a fuel for power generation and in industrial processes, but its low heat value and high moisture content make it less efficient than higher-rank coals. It is also used as a source of heat in residential heating systems. Lignite deposits are found in various parts of the world, particularly in areas with ancient swamps and marshes. Due to its high moisture content, lignite requires special handling and storage to prevent spontaneous combustion. Despite its lower quality compared to higher-rank coals, lignite remains an important energy resource in regions where it is abundant.",
    "wikiImage": "https://www.collinsdictionary.com/images/full/lignite_28183639.jpg"
  },
  {
    "name": "Chert",
    "description": "Chert is a hard, sedimentary rock primarily composed of microcrystalline or cryptocrystalline silica. It often occurs as nodules or layers in limestone, chalk, or dolomite formations. Chert is known for its smooth and glassy texture, and it can exhibit various colors such as white, gray, brown, black, or red, depending on the presence of impurities. It forms through the deposition of silica-rich materials in ancient marine or freshwater environments. Chert is commonly found in association with fossils, and it has been used by ancient civilizations for making tools, weapons, and ornaments due to its hardness and sharpness. It is also a common rock type in flintknapping, the ancient art of shaping stones into tools. Chert can have a conchoidal fracture, meaning it breaks with curved, shell-like patterns, making it ideal for creating sharp edges. In addition to its historical and archaeological significance, chert is valued today for its use in construction, road surfacing, and as a decorative stone in landscaping. Its durability and resistance to weathering make it a popular choice for outdoor applications.",
    "wikiImage": "https://media.istockphoto.com/id/1343021917/photo/flint-rock.jpg?s=612x612&w=0&k=20&c=l2MdF-IUV1b3QOaTsMAfkpLM0N0qVg7fv8N59M3SBPE="
  },
  {
    "name": "Oolite",
    "description": "Oolite is a sedimentary rock composed of small spherical grains called ooids. These grains are typically made up of calcium carbonate or silica. Oolite gets its name from the Greek word Oion, meaning egg, due to the egg-like shape of the ooids. The grains are usually less than 2 millimeters in diameter. Oolite often has a light color, ranging from white to beige or gray, but it can also occur in other hues such as pink, yellow, or brown. The formation of oolite involves the accumulation of ooids in shallow, warm marine environments or freshwater settings like caves and hot springs. Oolite is commonly used as a building stone due to its attractive appearance, durability, and ease of cutting and carving. It has been used in the construction of buildings, walls, and even entire cities throughout history. The unique spherical texture of oolite gives it a distinctive and visually appealing look, adding a touch of elegance to architectural designs.",
    "wikiImage": "https://www.alexstrekeisen.it/immagini/diagrammi/oolite.jpg"
  },
  {
    "name": "Travertine",
    "description": "Travertine is a sedimentary rock that forms from the precipitation of calcium carbonate minerals from water. It is typically light-colored, ranging from white to beige, and has a porous and banded appearance. Travertine is often used as a building and decorative material due to its unique texture and durability. It is formed in natural hot springs and limestone caves, where mineral-rich water flows and deposits the calcium carbonate over time. The distinctive porous structure of travertine is created by the trapped air bubbles during the precipitation process. It is commonly used in flooring, countertops, and wall cladding, adding an elegant and natural touch to architectural designs. Travertine is also valued for its resistance to heat and weathering, making it suitable for both indoor and outdoor applications. The rock's natural veining and variations in color create a visually appealing and unique aesthetic. As a natural stone, each piece of travertine has its own individual character, enhancing the overall beauty of any space it is used in.",
    "wikiImage": "https://m.media-amazon.com/images/I/812lOzOb3OL.jpg"
  },
  {
    "name": "Siltstone",
    "description": "Siltstone is a sedimentary rock composed primarily of silt-sized particles. It forms in environments with moderate energy, such as river floodplains, deltas, and shallow marine settings. The fine-grained nature of siltstone gives it a smooth and often slightly lustrous appearance. It ranges in color from gray and brown to red and yellow, depending on the mineral content. Siltstone is characterized by its ability to break along thin, parallel layers, known as bedding planes. These bedding planes can sometimes exhibit ripple marks or other sedimentary structures. Due to its compacted nature, siltstone is relatively resistant to weathering and erosion. It is commonly used as a construction material and as a source of sedimentary records for studying ancient environments and climate change. The formation of siltstone involves the gradual accumulation and compaction of silt-sized particles, typically carried by water or wind. Over time, these particles are lithified into a cohesive rock through pressure and cementation processes.",
    "wikiImage": "https://images.wisegeek.com/siltstone-against-white-background.jpg"
  },
  {
    "name": "Peat",
    "description": "Peat is an organic material formed from the partial decomposition of plant matter in waterlogged, acidic environments such as bogs and wetlands. It is typically dark brown or black in color and has a fibrous, spongy texture. Peat consists primarily of decomposed mosses, sedges, and other vegetation. Due to the slow decomposition process, peat accumulates over thousands of years, with each layer preserving a record of past environmental conditions. It is a valuable natural resource, often used as a fuel source for heating and electricity generation. Peat has also been historically utilized as a soil amendment for gardening and horticultural purposes. However, peat extraction can have significant environmental consequences, including habitat destruction, carbon dioxide emissions, and loss of biodiversity. As a result, there has been increasing emphasis on finding sustainable alternatives to peat in various industries, such as using compost or coir-based substrates for gardening and renewable energy sources for fuel.",
    "wikiImage": "https://www.biotopo.eu/wp-content/uploads/Peat-turf-1.jpg"
  },
  {
    "name": "Loess",
    "description": "Loess is a sedimentary rock composed predominantly of fine-grained, wind-blown silt particles. It is typically light yellow to tan in color and has a soft, crumbly texture. Loess deposits are widespread and can be found in regions with a history of windblown dust and sedimentation. These deposits often occur in extensive blankets or layers and can be several meters thick. Loess is known for its high fertility and is commonly associated with fertile agricultural regions. It is frequently utilized for farming due to its ability to retain moisture and provide essential nutrients for plant growth. Loess is also valued for its use in construction, as it can be easily excavated and compacted into stable foundations. The formation of loess involves the weathering and erosion of rocks, which releases fine particles into the air. These particles are then transported by wind over long distances before settling and accumulating as loess deposits. Over time, the accumulated silt particles become compacted and cemented, forming the characteristic rock known as loess.",
    "wikiImage": "https://museumofedible.earth/wp-content/uploads/2021/01/CN001A_DSC0553.jpg"
  },
  {
    "name": "Mudstone",
    "description": "Mudstone is a fine-grained sedimentary rock composed mainly of silt and clay particles. It forms in quiet depositional environments, such as lakes, lagoons, and offshore marine settings. The compacted and hardened layers of mudstone often exhibit a smooth, dull appearance with a range of colors, including shades of gray, brown, and green. Mudstone typically lacks visible grains or crystalline structures, giving it a homogeneous and earthy texture. Due to its fine particle size, mudstone has low permeability, making it less prone to water absorption and weathering compared to other sedimentary rocks. It is often used as a building material, providing stability and durability in construction projects. Mudstone records valuable information about past environmental conditions, serving as a geological archive for studying Earth's history. Its formation involves the gradual accumulation and compaction of sediment, resulting in a rock that reflects the sedimentary processes that shaped it.",
    "wikiImage": "https://media.istockphoto.com/id/507399916/photo/mineral-mudstone.jpg?s=612x612&w=0&k=20&c=s6doC5Z4VCK2Qv-8X3VfifjjThGPUyoSb3kk26ihZYg="
  },
  {
    "name": "Oil Shale",
    "description": "Oil shale is a sedimentary rock that contains organic matter known as kerogen, which can be converted into liquid hydrocarbons through a process called pyrolysis. It typically has a dark brown to black color and a fine-grained texture. Oil shale deposits are widespread and can be found in various parts of the world. They hold a significant amount of potential energy resources. Extracting oil from oil shale involves heating the rock to release the trapped hydrocarbons, which can then be further processed into usable fuels like shale oil. Oil shale is considered an unconventional source of energy and has both economic and environmental implications. While it holds the potential for increased energy independence and reduced reliance on traditional fossil fuels, its extraction and processing pose challenges due to high energy requirements and environmental impacts, such as greenhouse gas emissions and water usage. Ongoing research and development aim to improve the efficiency and sustainability of oil shale utilization as an energy resource.",
    "wikiImage": "https://geology.utah.gov/wp-content/uploads/snt41-1_oil-shale.jpg"
  },
  {
    "name": "Arkose",
    "description": "Arkose is a type of sedimentary rock that is composed of sand-sized grains of feldspar and quartz, along with smaller amounts of other minerals. It is characterized by its high feldspar content, which gives it a distinct pink or reddish color. Arkose forms in areas where there has been significant weathering and erosion of granite or other igneous rocks rich in feldspar. The feldspar grains in arkose are usually angular and show signs of mechanical weathering. Quartz grains are also present and are often well-rounded due to abrasion during transport. Arkose is commonly found in riverbeds, alluvial fans, and near the base of mountain ranges. Its coarse texture and high feldspar content make it easily distinguishable from other sedimentary rocks. Arkose is a durable rock that is often used as a building material and as a source of sand for construction. It is also of interest to geologists as it provides valuable clues about the geological history and processes that have shaped the Earth's surface.",
    "wikiImage": "https://www.sciencesource.com/pix/182/1822770-new-haven-arkose.jpg"
  },
  {
    "name": "Greywacke",
    "description": "Greywacke is a sedimentary rock composed of a mixture of fine-grained materials, such as sand, silt, and clay, along with larger rock fragments. It typically has a gray or dark gray color, giving it its name. Greywacke's texture can range from coarse to fine, depending on the size of the grains present. This rock often displays a gritty or sandy feel due to its composition. It is commonly found in areas where tectonic activity and mountain-building processes have occurred. Greywacke is known for its durability and strength, making it suitable for construction and building purposes, including as a material for foundations, walls, and pavements. Its compact nature also lends it well to being used as an aggregate in concrete and road construction. The distinct color and texture of greywacke can add a touch of natural elegance to both indoor and outdoor spaces, making it a versatile choice for architectural and decorative applications.",
    "wikiImage": "https://rockidentifier.com/wiki-image/1080/AFE9A36FF9754921A8B4334B6711593D.jpeg"
  },
  {
    "name": "Phosphorite",
    "description": "Phosphorite is a sedimentary rock that forms primarily from the accumulation of organic remains and phosphate minerals. It is typically light to dark gray in color and has a compact, granular texture. Phosphorite deposits are rich in phosphorus, a vital nutrient for plant growth and an essential component in fertilizer production. Due to its high phosphorus content, phosphorite is extensively mined for agricultural purposes. It is also used in the production of animal feed supplements and various industrial applications. The formation of phosphorite is closely linked to marine environments, where it accumulates in shallow seabeds or ancient marine sediments. Phosphorite deposits can contain other minerals and fossils, adding to their geological and scientific significance. With its importance in agriculture and industrial processes, phosphorite plays a crucial role in supporting food production and other vital sectors of the economy..",
    "wikiImage": "https://mineralseducationcoalition.org/wp-content/uploads/Phosphorite_136389572.jpg"
  },
  {
    "name": "Marble",
    "description": "Marble is a metamorphic rock that forms from the recrystallization of limestone under high heat and pressure. It is renowned for its timeless beauty, elegance, and wide range of colors and patterns. Marble typically features a smooth, polished surface that reflects light, giving it a luxurious appearance. It is composed primarily of calcite or dolomite minerals, which contribute to its characteristic veining and variations. This natural stone has been used for centuries in architecture, sculpture, and interior design due to its aesthetic appeal. Marble is prized for its durability, although it is susceptible to scratching and etching from acidic substances. It is commonly used for flooring, countertops, wall cladding, and decorative accents in both residential and commercial settings. With its exquisite veining and ability to add a touch of sophistication to any space, marble continues to be a popular choice for creating elegant and timeless designs.",
    "wikiImage": "https://m.media-amazon.com/images/I/61+txLzGS6L.jpg"
  },
  {
    "name": "Quartzite",
    "description": "Quartzite is a metamorphic rock that originates from the transformation of quartz-rich sandstone under high heat and pressure. It is characterized by its stunning beauty and exceptional durability, making it a popular choice for various applications. Quartzite typically exhibits a range of colors, including shades of white, gray, beige, and even vibrant hues like pink and red, adding a touch of elegance to any space. Its natural veining and texture give each slab a unique and distinctive appearance. Due to its high quartz content, quartzite is incredibly resistant to heat, scratches, and chemical damage, making it an ideal option for countertops, flooring, and wall cladding. With its remarkable strength and timeless beauty, quartzite has become a sought-after material for both residential and commercial projects, offering an exquisite blend of aesthetic appeal and durability.",
    "wikiImage": "https://thumbs.dreamstime.com/b/quartzite-nonfoliated-metamorphic-rock-composed-entirely-quartz-stone-isolated-white-background-215649607.jpg"
  },
  {
    "name": "Schist",
    "description": "Schist is a metamorphic rock that forms through the intense pressure and heat acting upon existing rocks, particularly shale or slate. It is characterized by its foliated texture, displaying distinct layers or bands of minerals. Schist commonly exhibits a range of colors, including shades of gray, green, brown, and even metallic tones. Its foliation gives it a unique shimmering or sparkling appearance when viewed from different angles. Due to its high mica content, schist often has a smooth and slightly slippery texture. It is valued for its durability, making it suitable for applications such as flooring, wall cladding, and decorative purposes. Schist's aesthetic appeal and diverse color variations make it a popular choice in both interior and exterior design, adding a touch of natural beauty to any space. With its distinctive layered structure and inherent strength, schist offers a visually appealing and robust option for various architectural and construction projects.",
    "wikiImage": "https://outforia.com/wp-content/uploads/2022/08/Schist-1.jpg"
  },
  {
    "name": "Gneiss",
    "description": "Gneiss is a metamorphic rock characterized by its banded or striped appearance, which is the result of alternating layers of different minerals. It forms through the process of high-grade metamorphism, where intense heat and pressure cause the original rock to recrystallize and reorganize its mineral structure. Gneiss typically exhibits a coarse texture and is composed of minerals such as quartz, feldspar, mica, and amphibole. Its color can vary widely, ranging from light gray and white to shades of pink, green, and black. Gneiss is often used as a building material due to its durability and attractive appearance. It is commonly found in mountainous regions and is associated with tectonic processes such as continental collision and mountain building. Gneiss is an important rock for geologists as it provides insights into the history and evolution of the Earth's crust.",
    "wikiImage": "https://media.istockphoto.com/id/152548053/photo/isolated-sample-of-gneiss.jpg?s=612x612&w=0&k=20&c=i1wdmmTp1Rgp0hknS4wSQyDgI18CWo4OTIl4t3CKFfE="
  },
  {
    "name": "Amphibolite",
    "description": "Amphibolite is a metamorphic rock that is predominantly composed of amphibole minerals, such as hornblende. It forms through the process of high-grade metamorphism, which involves intense heat and pressure acting on existing rocks. Amphibolite has a distinct dark green to black color and a medium to coarse-grained texture. It is known for its strong and durable nature, making it a popular choice for construction and decorative purposes. The presence of amphibole minerals gives amphibolite its characteristic shiny appearance and high strength. It often displays a foliated or banded structure, with alternating layers of light and dark minerals. Amphibolite is commonly found in regions with significant tectonic activity, such as mountain belts and areas associated with plate convergence. It provides valuable information about the geological processes that have shaped the Earth's crust and is an important rock for understanding the dynamics of mountain building and plate tectonics.",
    "wikiImage": "https://mineralseducationcoalition.org/wp-content/uploads/amphibole_56068876.jpg"
  },
  {
    "name": "Phyllite",
    "description": "Phyllite is a metamorphic rock that forms from the transformation of sedimentary rocks, such as shale or mudstone, under moderate heat and pressure. It is characterized by its fine-grained texture and distinct foliation, which consists of parallel layers or bands of minerals.Phyllite has a shiny appearance due to the presence of mica minerals, such as muscovite or biotite, which reflect light off its surfaces.The rock commonly exhibits colors ranging from gray to green, resulting from the presence of minerals like chlorite. It has a smooth and dense texture, and its excellent cleavage allows it to be easily split into thin, flat sheets. Phyllite is often used as a decorative stone and has been historically valued for roofing material due to its ability to be split into thin, durable pieces. It is commonly found in regions that have undergone moderate metamorphic conditions, typically associated with mountain-building processes. Phyllite is frequently found alongside other metamorphic rocks like slate, schist, and gneiss, which share similar geological origins.",
    "wikiImage": "https://www.geologysuperstore.com/wp-content/uploads/2023/03/phyllite.jpg"
  },
  {
    "name": "Migmatite",
    "description": "Migmatite is a unique rock formed by simultaneous metamorphic and igneous processes. It results from partial melting of rocks under high temperatures and pressures. Migmatite displays distinct banding between light-colored granitic-like regions (leucosome) and dark-colored metamorphic-like regions (melanosome). The leucosome forms from partial melting and crystallization, resembling igneous rocks. The melanosome retains characteristics of the original metamorphic rock. Migmatite's appearance varies based on composition and degree of metamorphism and melting. It forms during intense geological processes like tectonic plate collisions or mountain-building. Migmatite provides insights into complex geological history, capturing the interplay between metamorphism and igneous activity. Geologists and rock enthusiasts find migmatite intriguing for its origin and visually striking patterns.",
    "wikiImage": "https://www.geologysuperstore.com/wp-content/uploads/2023/03/mylonite.jpg"
  },
  {
    "name": "Eclogite",
    "description": "Eclogite is a rare and highly distinctive metamorphic rock that forms under extreme conditions of high pressure and temperature. It typically consists of two main minerals: garnet and omphacite, a type of pyroxene. Eclogite is known for its striking color combination of deep green garnet crystals embedded in a dark green to black matrix of omphacite. The presence of these minerals indicates that the rock has undergone subduction, a process in which one tectonic plate is forced beneath another. Eclogite is considered a key indicator of deep-seated processes in the Earth's crust and mantle. It is commonly found in regions associated with mountain building and subduction zones. Due to its high density and durability, eclogite is often used as a decorative stone and for specialized purposes such as jewelry and gemstones. Its unique composition and formation process make eclogite a fascinating rock for geologists studying the deep geological history of the Earth.",
    "wikiImage": "https://i.pinimg.com/originals/5d/c1/88/5dc1881230e07b746470a38b8511f063.jpg"
  },
  {
    "name": "Soapstone",
    "description": "Soapstone, also known as steatite, is a metamorphic rock primarily composed of talc. It is characterized by its soft and smooth texture, which gives it a soapy feel when touched. Soapstone is typically gray, green, or white in color and can develop a patina over time. It is relatively easy to carve and shape, making it a popular material for sculptures, countertops, and various other applications. Soapstone is heat-resistant, non-porous, and has excellent thermal conductivity, making it suitable for use in fireplaces, ovens, and cookware. It has been used for centuries in different cultures for its practical and aesthetic qualities. Soapstone, with its unique combination of softness, smoothness, and heat resistance, continues to be valued for its versatility and aesthetic appeal in both traditional and modern applications.",
    "wikiImage": "https://media.istockphoto.com/id/492254908/photo/talc.jpg?s=612x612&w=0&k=20&c=hTggN4IXyYLUnIVt1-SZTwwMV4rzYg6pSByofd43L5c="
  },
  {
    "name": "Blueschist",
    "description": "Blueschist is a distinctive metamorphic rock formed under high-pressure, low-temperature conditions. It derives its name from its characteristic blue color, which is attributed to the presence of minerals like glaucophane and lawsonite. Blueschist typically has a fine-grained texture and often exhibits foliation or banding. It forms in subduction zones where oceanic crust is forced beneath continental crust, experiencing intense pressure and low temperatures. Blueschist's unique geological formation and striking blue hue make it a fascinating rock for study and a sought-after material for decorative purposes. Its unique combination of color, texture, and formation provides valuable insights into the geological processes occurring deep within the Earth's crust and is treasured by geologists and rock enthusiasts alike.",
    "wikiImage": "https://i.pinimg.com/736x/ae/cc/b1/aeccb1871a0d2bcdc74ad5e8a23cc390--metamorphic-rock-minerals.jpg"
  },
  {
    "name": "Greenstone",
    "description": "Greenstone is a type of metamorphic rock that is characterized by its green color and typically composed of minerals such as chlorite, actinolite, and epidote. It is formed through the metamorphism of basalt or other mafic volcanic rocks. Greenstone often exhibits a banded or layered appearance due to the alternating composition of its minerals. It is commonly found in regions with a history of volcanic activity and tectonic plate movement. Greenstone is known for its durability and resistance to weathering, making it a popular choice for construction and decorative purposes. Its vibrant green color and unique texture make it sought after for jewelry and ornamental objects. Greenstone is also significant in geological studies as it provides valuable insights into the Earth's ancient geological processes and the evolution of the Earth's crust.",
    "wikiImage": "https://cdn.britannica.com/43/128543-050-1AD6F86C/Slate.jpg"
  },
  {
    "name": "Serpentinite",
    "description": "Serpentinite is a metamorphic rock characterized by its dominant composition of serpentine group minerals. It derives its name from the unique texture and appearance resembling the skin of a serpent. Serpentinite is formed through a process called serpentinization, which occurs when ultramafic rocks from the Earth's mantle are altered by the addition of water and undergo metamorphic transformations. This rock is typically green in color and has a waxy or slippery feel due to the high concentration of serpentine minerals. Serpentinite often exhibits a mottled or veined appearance with various shades of green, along with occasional patches of other minerals like chromite or magnetite. It is commonly found in areas where tectonic forces have brought ultramafic rocks closer to the Earth's surface, such as along subduction zones or in ophiolite complexes. Serpentinite is an important rock in geology as it plays a role in the geochemical cycling of elements and can serve as a host for certain types of ore deposits.",
    "wikiImage": "https://www.geologysuperstore.com/wp-content/uploads/2023/03/serpentine.jpg"
  },
  {
    "name": "Hornfels",
    "description": "Hornfels is a fine-grained metamorphic rock that forms through the process of contact metamorphism. It is created when pre-existing rocks, such as shale, limestone, or sandstone, come into contact with high temperatures and pressures caused by nearby intrusions of magma or lava. As a result, the minerals within the rock recrystallize and form a dense, hard texture. Hornfels typically lacks any visible grain structure or foliation, giving it a uniform appearance. The rock often exhibits a dark color, ranging from gray to black, due to the recrystallization process. It is known for its durability and resistance to weathering and erosion. Hornfels is commonly found near igneous intrusions, such as dykes or sills, and is often used as a thermal indicator to determine the proximity of ancient magma bodies. Due to its hardness and durability, hornfels has been utilized as a construction material and can be found in various architectural applications.",
    "wikiImage": "https://3.bp.blogspot.com/-Co2DZnxkp14/WLlnte8hngI/AAAAAAAAEsg/YXshMGnnjCgjiE44iHWvT5trCe2UQCm4gCLcB/s1600/hornfels.jpg"
  },
  {
    "name": "Glaucophane-Schist",
    "description": "Glaucophane-schist is a metamorphic rock that is primarily composed of the mineral glaucophane. It belongs to the blueschist facies of metamorphism and is typically formed in subduction zones where oceanic crust is being subducted beneath a continental plate. The rock has a distinctive blue or bluish-green color due to the presence of glaucophane, which is a sodium-rich amphibole mineral. Glaucophane-schist is characterized by its fine-grained texture and foliated structure, with layers or bands of glaucophane-rich material alternating with other minerals like quartz, albite, and garnet. The schistosity or foliation is a result of the intense pressure and shearing forces experienced during the metamorphic process. Glaucophane-schist is a valuable indicator of high-pressure metamorphism and is commonly associated with eclogite, another high-pressure metamorphic rock. It provides important insights into the tectonic processes occurring within subduction zones. The presence of glaucophane-schist suggests the occurrence of ancient subduction events and can help geologists reconstruct the geological history of a region. The rock is often found in mountainous regions and is prized by collectors and researchers for its unique color and geological significance.",
    "wikiImage": "https://www.geologysuperstore.com/wp-content/uploads/2022/10/graphitic_schist.jpg"
  },
  {
    "name": "Pseudotachylite",
    "description": "Pseudotachylite rock is a type of rock formed during high-energy seismic events such as earthquakes or meteorite impacts. It is characterized by its glassy or fine-grained texture, typically appearing black or dark gray. Pseudotachylite forms when intense friction and heat along fault lines cause rocks to melt and rapidly cool. The name pseudotachylite comes from the Greek words for false and rapid, referring to its volcanic-like appearance. It often occurs as vein-like structures or injections within surrounding rocks, indicating its formation through the injection of molten material into fractures. Composed of minerals like quartz, feldspar, and mafic minerals such as pyroxene or amphibole, pseudotachylite provides valuable information about past seismic activity and the dynamics of earthquakes. By studying pseudotachylite, scientists can gain insights into the intensity, duration, and mechanisms of ancient seismic events, contributing to our understanding of Earth's geological history and seismic hazards.",
    "wikiImage": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQsmMEthkVWzwoiCK9c9R2_U0T2wkKxiwc4UA&usqp=CAU"
  },
  {
    "name": "Granulite",
    "description": "Granulite rock is a high-grade metamorphic rock known for its coarse-grained texture and distinctive mineral composition. It forms under conditions of high temperature and pressure, typically deep within the Earth's crust. The name granulite refers to its granular appearance, characterized by the interlocking arrangement of its mineral grains. Composed primarily of minerals such as quartz, feldspar, and mafic minerals like pyroxene or amphibole, granulite often exhibits a banded or layered structure. Its formation involves the recrystallization and transformation of pre-existing rocks, resulting in the development of new mineral assemblages. Granulite rocks commonly occur in regions of ancient continental crust, and they are often associated with tectonic processes such as mountain building or collisional events. They provide valuable insights into the geological history of the Earth, including the processes of continental evolution and the formation of large-scale mountain ranges. The presence of granulite indicates the occurrence of significant heat and pressure in the past, and its study contributes to our understanding of the deep Earth processes and the dynamics of plate tectonics.",
    "wikiImage": "https://geodil.dperkins.org/i/362.jpg"
  },
  {
    "name": "Skarn",
    "description": "Skarn rock is a type of metamorphic rock that forms through the interaction of hot fluids with existing rocks, typically in contact metamorphic environments. It is characterized by its distinct mineral assemblage, which often includes minerals such as garnet, pyroxene, and calcite. Skarns commonly occur near intrusive igneous bodies, where the heat and fluids released during the intrusion react with the surrounding rocks, leading to mineralogical changes. The process of skarn formation involves the replacement of the original rock minerals by new minerals deposited from the fluids. Skarn rocks can exhibit a wide range of colors and textures, depending on the specific minerals present. They often display a banded or layered structure due to the alternating deposition of different minerals. Skarns are economically significant as they can contain valuable ore minerals such as copper, zinc, or iron, making them potential targets for mining activities. They provide important clues about the geological history of an area, including the past magmatic activity and fluid interactions, and contribute to our understanding of mineralization processes.",
    "wikiImage": "https://i.pinimg.com/originals/40/76/fc/4076fcb3fb06d4810e4ff7e2e62a70bb.jpg"
  },
  {
    "name": "Dunite",
    "description": "Dunite is a type of ultramafic rock primarily composed of the mineral olivine. It is a coarse-grained rock that has a greenish-yellow to olive-green color, often with a speckled appearance. The predominant mineral olivine gives dunite its characteristic composition and texture. Dunite is rich in magnesium and iron, with olivine typically comprising more than 90% of its composition. Due to its high magnesium content, dunite is considered an ultramafic rock and is closely related to peridotite. Dunite is primarily formed through the solidification of magma deep within the Earth's mantle, and it is often associated with tectonic processes such as the uplifting and erosion of oceanic lithosphere. Its coarse-grained nature indicates slow cooling and crystallization. Dunite is commonly found in mantle-derived igneous complexes, such as ophiolites, where it represents the residue left behind after the extraction of basaltic magma. It is also associated with certain types of volcanic eruptions, particularly those related to mantle plumes. In addition, dunite is used as a refractory material due to its high melting point and resistance to heat and corrosion.",
    "wikiImage": "https://www.geologysuperstore.com/wp-content/uploads/2023/03/agglomerate.jpg"
  },
  {
    "name": "Aplite",
    "description": "Aplite is a fine-grained intrusive igneous rock that is typically light in color, commonly ranging from white to light gray. It is composed predominantly of quartz and feldspar minerals, such as orthoclase and plagioclase. Aplite forms when magma intrudes into existing rock formations and undergoes rapid cooling and crystallization near the Earth's surface. The fine-grained nature of aplite suggests its formation through relatively fast cooling rates. It often occurs as dikes or veins that cut across other rocks, indicating its intrusive origin. Aplite is commonly associated with granite and is considered a granitic rock. It is often found in regions with extensive granite intrusions, such as mountain ranges or granite batholiths. Aplite is used as a decorative stone and can be polished to enhance its aesthetic appeal. Due to its high quartz content, aplite is sometimes quarried for its silica, which is used in the production of glass and ceramics.",
    "wikiImage": "https://www.virtualmicroscope.org/sites/default/files/hero-11AGT24a-Img11901.jpg"
  },
  {
    "name": "Petrified wood",
    "description": "Petrified wood is a fossilized form of wood where the organic material has been replaced with minerals, typically silica, over millions of years. It retains the external appearance and structural elements of the original wood, but its composition is now stone-like. Petrified wood commonly displays a wide range of colors, including shades of brown, red, yellow, and even vibrant hues due to the presence of different minerals. The preservation process occurs through a combination of mineral-rich water seeping into the wood's cellular structure and the slow decay of organic matter. This transformation results in a durable and solid material that can be polished and used for various decorative and artistic purposes. Petrified wood serves as a window into the past, providing insights into ancient forests and ecosystems. It is often found in areas with sedimentary rocks and volcanic activity. With its unique beauty and intriguing geological history, petrified wood is highly prized for its aesthetic appeal, as well as its scientific and educational value.",
    "wikiImage": "https://img2.cgtrader.com/items/3935094/9209910bb5/large/petrified-wood-3-3d-model-low-poly-obj-fbx-stl-blend.jpg"
  },
  {
    "name": "Kimberlite",
    "description": "Kimberlite is a volcanic rock known for its association with diamonds. It is typically bluish-gray or greenish in color and has a porphyritic texture, characterized by larger crystals dispersed within a fine-grained matrix. Kimberlite forms deep within the Earth's mantle and is brought to the surface through explosive volcanic eruptions. These eruptions create kimberlite pipes, which are vertical, cylindrical structures that often contain diamond deposits. Kimberlite is rich in minerals such as olivine, pyroxene, and serpentine, and may also contain indicator minerals that provide clues about the potential presence of diamonds. The study and exploration of kimberlite are of great interest to geologists and mining companies seeking valuable diamond resources. While most kimberlite does not contain economically viable diamond deposits, the discovery of kimberlite rock is an exciting indication of the potential for valuable gemstones in the surrounding area.",
    "wikiImage": "https://st2.depositphotos.com/1077338/12253/i/950/depositphotos_122534636-stock-photo-natural-kimberlite-mineral-isolated-on.jpg"
  },
  {
    "name": "Gossan",
    "description": "Gossan rock, also known as iron hat or iron cap, is a type of weathered mineral deposit that forms near the surface of ore bodies. It is typically characterized by its rusty brown or reddish color, which results from the oxidation of iron minerals. Gossan forms when sulfide minerals, such as pyrite or chalcopyrite, are exposed to air and water, causing them to react and release iron oxide compounds. The weathering process alters the mineralogy of the rock and often leads to the formation of secondary minerals, such as limonite or goethite. Gossan rock can serve as a surface indication of underlying mineral deposits, making it a significant exploration tool for prospectors and geologists. Its distinctive color and altered mineralogy make it visually striking and unique in the geological landscape. Gossan formations are commonly associated with metallic ore deposits, including copper, zinc, gold, and silver. The study and analysis of gossan rock provide valuable insights into the geology and potential mineral wealth of an area.",
    "wikiImage": "https://static.educalingo.com/img/en/800/aerugite.jpg"
  },
  {
    "name": "Olivine",
    "description": "Olivine rock, also known as peridotite, is a common igneous rock composed primarily of the mineral olivine. It typically appears as a greenish-gray or olive-green rock with a granular or coarse texture. Olivine is a magnesium-iron silicate mineral that crystallizes under high temperatures and pressures deep within the Earth's mantle. Olivine rock is often associated with ultramafic rocks and is a major constituent of the Earth's upper mantle. It can also be found in meteorites and volcanic rocks such as basalt. Olivine rock has a high melting point and is resistant to weathering, making it a durable and stable mineral. It is used in various applications, including as a refractory material in high-temperature processes, as a component in building materials, and as a gemstone known as peridot when transparent and of high quality. The presence of olivine rock can provide important clues about the geological history and composition of a region",
    "wikiImage": "https://i.etsystatic.com/35856333/r/il/1451dd/4071810684/il_570xN.4071810684_fwbb.jpg"
  },
  {
    "name": "Anthracite",
    "description": "Anthracite rock is a type of coal that is highly metamorphosed and has the highest carbon content among all coal types. It is known for its glossy black appearance and high energy content. Anthracite forms through the progressive metamorphism of bituminous coal over millions of years, resulting in a hard, dense, and almost pure carbon material. It has a low moisture and volatile content, which contributes to its high heating value and clean-burning properties. Anthracite is primarily used as a fuel source for residential and industrial heating due to its efficient combustion and long burn time. It is also utilized in the production of electricity, as a reducing agent in metallurgical processes, and as a component in water filtration systems. The compact nature of anthracite makes it resistant to weathering and erosion, allowing it to retain its properties over time. Its high carbon content and low impurities make anthracite a valuable resource for energy production and various industrial applications.",
    "wikiImage": "https://lh3.googleusercontent.com/-HGNvuOp5JKs/USEMzgfeZ0I/AAAAAAAAIVo/hiLzKUcL38I/s512/IMG_8327%2525208%252520cm%252520anthracite.jpg"
  },
  {
    "name": "Chalcedony",
    "description": "Chalcedony rock is a type of silica-rich sedimentary or metamorphic rock composed mainly of microcrystalline quartz. It is characterized by its smooth and waxy appearance and can occur in various colors, including white, gray, blue, pink, and brown. Chalcedony forms through the deposition of silica-rich solutions in cavities and fractures of rocks, resulting in its fine-grained and compact texture. It is often found in association with other minerals and can exhibit different patterns and formations such as bands, layers, and agate-like structures. Chalcedony has been utilized for centuries in jewelry and ornamental objects due to its beauty, durability, and ease of shaping. It is also believed to have metaphysical properties, symbolizing balance, harmony, and positivity. Chalcedony rock continues to be valued for its aesthetic appeal and is a popular choice for gemstone enthusiasts and artisans alike.",
    "wikiImage": "https://i.pinimg.com/736x/33/4d/1e/334d1e901c6ed7cc27c7d43359ac5359.jpg"
  },
  {
    "name": "Jasper",
    "description": "Jasper is a dense and opaque variety of chalcedony, a microcrystalline form of quartz. It is known for its vibrant and earthy colors, including red, brown, yellow, green, and combinations thereof. Jasper forms through the deposition of silica-rich fluids in cracks and cavities within rocks, resulting in its fine-grained and often banded or spotted appearance. It is often found in association with volcanic activity and sedimentary deposits. Jasper has been highly valued throughout history for its beauty and versatility. It has been used in jewelry, decorative objects, and as a material for carving and crafting. Jasper is believed to possess grounding and protective energies, symbolizing strength, stability, and connection to the Earth. Its rich colors and unique patterns make jasper a sought-after material for both artistic and metaphysical purposes.",
    "wikiImage": "https://www.minerals-kingdom.com/wp-content/uploads/2015/03/jasper-stone.jpg"
  },
  {
    "name": "Lapis lazuli",
    "description": "Lapis lazuli is a vibrant blue metamorphic rock composed mainly of the mineral lazurite. It has been highly valued for centuries due to its intense blue color and is often used as a gemstone and in artistic creations. Lapis lazuli is also known for its distinctive golden pyrite inclusions, which add a sparkling effect to its appearance. It is believed to have been mined as early as 6,000 years ago and has been used in jewelry, decorative objects, and even as a pigment for paintings. This rock is associated with spirituality and is said to enhance wisdom, inner peace, and communication. Its rich history, mesmerizing color, and metaphysical properties make lapis lazuli a captivating and sought-after gemstone.",
    "wikiImage": "https://www.jewelrycult.com/wp-content/uploads/2016/03/lapis-lazuli.jpg"
  },
  {
    "name": "Agate",
    "description": "Agate is a banded form of chalcedony, characterized by its stunning array of colors and intricate patterns. This beautiful semi-precious gemstone is known for its translucent appearance and smooth texture. Agate is formed within volcanic rocks and is composed of layers of silica minerals. Its wide range of colors, including shades of blue, brown, green, and red, make it highly desirable for jewelry and ornamental purposes. The unique banding and vibrant hues found in agate add a touch of natural elegance to any design. Due to its durability and versatility, agate has been used for centuries in decorative objects, carvings, and even as healing stones. Its mesmerizing patterns and captivating beauty continue to captivate enthusiasts and collectors around the world.",
    "wikiImage": "https://i.ebayimg.com/images/g/dtUAAOSwWhJhAfyK/s-l1600.jpg"
  },
  {
    "name": "Brecciated jasper",
    "description": "Brecciated jasper is a distinctive and captivating variety of jasper that is characterized by its fragmented and angular appearance. It forms when the natural process of brecciation occurs, where fragments of rock are cemented together by silica or another mineral. This gives brecciated jasper its unique texture and pattern, showcasing a beautiful mosaic of colors and shapes. The colors exhibited by this stone can range from earthy reds and browns to vibrant oranges and yellows, adding a warm and rustic charm to any setting. Its polished surface highlights the intricate interplay between the different rock fragments, creating a visually appealing and dynamic stone. Brecciated jasper is valued not only for its aesthetic appeal but also for its believed grounding and stabilizing properties, making it a popular choice for jewelry and spiritual practices. Its rich history and unique appearance make brecciated jasper a fascinating addition to any collection or decor",
    "wikiImage": "https://www.thecrystalman.com/wp-content/uploads/2022/03/Tumbled-Brecciated-Jasper-lg-34b.jpg"
  },
  {
    "name": "Lava rock",
    "description": "Lava rock, also known as volcanic rock or basalt, is a type of igneous rock that forms from molten lava that cools and solidifies rapidly on the Earth's surface or in volcanic eruptions. It is characterized by its porous and rough texture, created by the rapid escape of gases during the cooling process. The color of lava rock can vary, ranging from deep black to dark gray or reddish-brown hues. Its lightweight and porous nature make it ideal for various practical applications, such as as a construction material, in landscaping, or as a component in filtration systems. Lava rock is also popularly used in decorative settings, as it adds a natural and rustic touch to gardens, aquariums, and fire pits. Additionally, it is believed to possess grounding and protective properties, making it a popular choice in metaphysical and spiritual practices. The unique formation process and distinct appearance of lava rock make it an intriguing and versatile rock type",
    "wikiImage": "https://m.media-amazon.com/images/I/91eR-y7MsyL.jpg"
  },
  {
    "name": "Porphyr",
    "description": "Porphyry rock is an igneous rock that typically consists of large crystals embedded in a fine-grained matrix. It is formed through the cooling and solidification of magma deep within the Earth's crust. The large crystals, known as phenocrysts, are often composed of minerals such as feldspar, quartz, or mica, while the surrounding matrix is composed of smaller crystals or a glassy material. The texture of porphyry rock is distinctive, with the stark contrast between the large crystals and the finer-grained background. This rock type comes in a variety of colors, including red, green, brown, and gray, depending on the mineral composition. Porphyry rock has been widely used throughout history as a construction material due to its durability and aesthetic appeal. It can be found in architectural elements, statues, and even ancient structures. Its unique texture and striking appearance make it a sought-after material for both practical and decorative purposes.",
    "wikiImage": "https://www.911metallurgist.com/blog/wp-content/uploads/2016/08/Types-of-Porphyritic-Rocks.jpg"
  },
  {
    "name": "Gabbroic Anorthosite",
    "description": "Gabbroic anorthosite is a type of igneous rock that is primarily composed of plagioclase feldspar and pyroxene minerals. It is characterized by its coarse-grained texture, with large crystals of feldspar and pyroxene embedded in a finer-grained matrix. The dominant mineral in gabbroic anorthosite is plagioclase feldspar, which gives the rock its light-colored appearance. It often exhibits a speckled or mottled texture due to the presence of dark-colored pyroxene minerals. Gabbroic anorthosite is typically found in layered intrusions, where it forms as a result of the fractional crystallization of magma deep within the Earth's crust. This rock type is known for its strength and durability, making it suitable for a variety of applications, including construction materials, countertops, and decorative stone. The unique combination of light and dark minerals in gabbroic anorthosite creates a visually striking appearance, adding to its appeal in both practical and aesthetic contexts.",
    "wikiImage": "https://www.sandatlas.org/wp-content/uploads/00303-7-cm-IMG_6188-gabbro-Cyprus2.jpg"
  },
  {
    "name": "Syenite",
    "description": "Syenite is a coarse-grained igneous rock that primarily consists of orthoclase feldspar, plagioclase feldspar, and a small amount of mafic minerals such as hornblende or biotite. It has a granular texture with distinct crystals visible to the naked eye. Syenite is typically light to medium gray in color, but variations in mineral composition can result in different hues, including pink, yellow, or green. The presence of feldspar gives syenite a distinctive luster and often a speckled appearance. It forms from the solidification of magma deep within the Earth's crust and is commonly found in plutonic bodies or as intrusive dikes. Syenite is known for its durability and strength, making it a popular choice for construction projects, decorative purposes, and as a raw material for countertops and tiles. The unique combination of feldspar and mafic minerals gives syenite its characteristic appearance and sets it apart from other rock types.",
    "wikiImage": "https://geologyscience.com/wp-content/uploads/2018/04/Syenite.jpg"
  },
  {
    "name": "Trachyte",
    "description": "Trachyte is a fine-grained volcanic rock that is primarily composed of alkali feldspar, such as sanidine or orthoclase, along with smaller amounts of mafic minerals like biotite, hornblende, or augite. It has a porphyritic texture, with larger phenocrysts embedded in a fine-grained matrix. The color of trachyte can vary, ranging from light gray or beige to pink, green, or even purple, depending on the mineral composition. It forms through the solidification of magma that is rich in silica and low in iron and magnesium content. Trachyte often occurs in volcanic domes, lava flows, or as intrusive dikes and sills. Due to its fine-grained nature and relatively low porosity, trachyte is highly resistant to weathering and erosion. It is commonly used as a building material, especially for decorative purposes such as cladding, paving stones, and sculptures. The unique combination of alkali feldspar and mafic minerals gives trachyte its characteristic appearance and distinguishes it from other volcanic rocks.",
    "wikiImage": "https://geologyscience.com/wp-content/uploads/2018/04/Trachyte.jpg"
  },
  {
    "name": "Dolerite",
    "description": "Dolerite is a medium-grained igneous rock that is primarily composed of plagioclase feldspar, pyroxene minerals (such as augite or hypersthene), and minor amounts of other minerals like olivine or biotite. It typically has a dark gray to black color and a fine-grained texture. Dolerite forms when magma solidifies below the Earth's surface, specifically in the upper part of the crust. It is an intrusive rock, commonly occurring as dikes or sills, and can also be found as large bodies called plutons. Due to its fine-grained nature, dolerite often displays a distinctive microscopic texture known as ophitic texture, where the larger plagioclase crystals are enclosed within pyroxene minerals. Dolerite is known for its high strength and durability, making it suitable for various construction purposes, including road surfacing, railroad ballast, and as a building stone. It is also used in the production of crushed stone and aggregate for concrete. The presence of dolerite in certain regions can indicate geological events such as volcanic activity or tectonic processes.",
    "wikiImage": "https://static.wixstatic.com/media/dcc3a1_4a5132f18e044fae98694bae2a428eb7~mv2.jpg/v1/fill/w_3024,h_3024,al_c,q_85/dcc3a1_4a5132f18e044fae98694bae2a428eb7~mv2.jpg"
  },
  {
    "name": "Feldspar",
    "description": "Feldspar is not a specific type of rock, but rather a group of minerals that are the most abundant in the Earth's crust. Feldspar minerals are composed primarily of aluminum, silicon, and oxygen, along with other elements like sodium, potassium, and calcium. They can be found in a wide range of rock types, including granite, gneiss, and basalt. Feldspar minerals have a vitreous to pearly luster and come in various colors, such as white, pink, gray, or green. They have a hardness of 6 on the Mohs scale and exhibit a distinct cleavage. Feldspar minerals play a significant role in the formation of igneous, metamorphic, and sedimentary rocks. They are essential components in the construction industry, where they are used in the production of ceramics, glass, and as a flux in the manufacturing of steel. Feldspar minerals also have important geochronological and petrological applications, helping scientists determine the age and origin of rocks.",
    "wikiImage": "https://mineralseducationcoalition.org/wp-content/uploads/Feldspar2_353331161.jpg"
  },
  {
    "name": "Hornblende",
    "description": "Hornblende is not a rock itself, but rather a mineral that is commonly found in various types of rocks, including igneous and metamorphic rocks. It belongs to the amphibole group of minerals and is typically dark green to black in color. Hornblende has a prismatic crystal habit and often forms elongated crystals or needle-like aggregates. It has a hardness of 5 to 6 on the Mohs scale and a cleavage angle of approximately 56 and 124 degrees. The mineral is primarily composed of calcium, magnesium, aluminum, iron, and silicate ions. Hornblende is an important mineral in the formation of many rock types, such as diorite, gabbro, and amphibolite. It is often used as an indicator of the mineral assemblage and metamorphic conditions during rock formation. Hornblende-rich rocks can exhibit a range of textures and appearances, depending on their specific composition and geological history.",
    "wikiImage": "https://www.sciencesource.com/pix/183/1836457-hornblende-granite.jpg"
  },
  {
    "name": "Pyroxene",
    "description": "Pyroxene is not a rock itself but a group of rock-forming minerals. Pyroxene minerals are commonly found in various types of rocks, including basalt, gabbro, and pyroxenite. These minerals belong to the inosilicate group and are characterized by their dark coloration and prismatic crystal habit. Pyroxene minerals have a hardness of 5 to 6 on the Mohs scale and exhibit good cleavage. They are primarily composed of magnesium, iron, calcium, aluminum, and silicate ions. Pyroxene-rich rocks can have a range of textures and appearances, from fine-grained to coarse-grained, depending on their specific composition and geological history. The presence of pyroxene minerals in rocks can provide important insights into their formation and geologic processes.",
    "wikiImage": "https://media.sciencephoto.com/c0/50/37/86/c0503786-800px-wm.jpg"
  },
  {
    "name": "Diamond",
    "description": "Diamonds are highly valued gemstones known for their beauty and durability. They are formed deep within the Earth's mantle under intense heat and pressure over billions of years. Composed of carbon atoms arranged in a unique crystal lattice structure, diamonds possess exceptional hardness, making them the hardest naturally occurring substance.Diamonds are renowned for their optical properties, exhibiting a captivating sparkle and brilliance. They come in a range of colors, with colorless diamonds being the most prized. Diamonds are not only cherished for their aesthetic appeal but also hold cultural significance, symbolizing love, commitment, and wealth.In addition to their use in jewelry, diamonds have industrial applications due to their hardness. They are utilized in cutting tools, drill bits, and high-tech industries like electronics. Diamonds continue to captivate with their enduring beauty and representation of strength.",
    "wikiImage": "https://a-z-animals.com/media/2022/05/Shutterstock_1216122388-1.jpg"
  },
  {
    "name": "Jade",
    "description": "Jade, a revered gemstone with a rich cultural heritage, captivates with its vibrant green hues and smooth, polished appearance. This precious rock has been treasured for centuries for its symbolic significance and aesthetic allure. With its distinct beauty and spiritual connotations, jade is believed to bring luck, abundance, and harmony to those who possess it. Its resilience and durability make it a favored material for intricate carvings, exquisite jewelry, and ornamental artifacts, showcasing the skill and artistry of craftsmen. Jade is deeply intertwined with Asian cultures, where it is regarded as a symbol of wisdom, purity, nobility, and immortality. As a healing stone, jade is thought to promote balance, serenity, and emotional well-being while warding off negative energies. Its timeless elegance, mystical qualities, and cultural reverence continue to make jade a sought-after gemstone worldwide, cherished for its beauty and metaphysical properties.",
    "wikiImage": "https://m.media-amazon.com/images/I/61Bi-uFgunL._AC_UF894,1000_QL80_.jpg"
  },
  {
    "name": "Ruby",
    "description": "Ruby, known as the King of Gemstones, is a precious rock prized for its vibrant red color and remarkable beauty. Its fiery hue is reminiscent of passion and vitality, evoking a sense of power and courage. With its exceptional hardness and durability, ruby is not only a stunning gemstone but also a symbol of strength and resilience. Adorned with historical and cultural significance, ruby has been treasured throughout the ages as a stone of nobility and luxury. It is believed to bring love, success, and good fortune to its wearer, igniting a spark of passion and ambition. Ruby's brilliance and allure make it a coveted gemstone for exquisite jewelry pieces, from statement rings to elegant necklaces. Its association with love and passion has made ruby a popular choice for engagement rings, symbolizing deep affection and commitment. As a gemstone of vitality and vitality, ruby carries an energy that invigorates the spirit and inspires a zest for life.",
    "wikiImage": "https://st4.depositphotos.com/1214496/20139/v/600/depositphotos_201390170-stock-illustration-red-rubies-white-background-gemstones.jpg"
  },
  {
    "name": "Sapphire",
    "description": "Sapphire, the gemstone of celestial beauty, holds a place of honor among the most revered and sought-after gemstones. With its mesmerizing blue hues ranging from deep midnight to vibrant cornflower, sapphire is a symbol of wisdom, nobility, and divine blessings. Its velvety brilliance and exceptional hardness make it a gemstone of enduring allure and durability. Admired for centuries, sapphire has adorned the crowns and jewelry of royalty and is considered a talisman of protection and good fortune. Its captivating blue color is said to evoke feelings of calmness, tranquility, and inner peace, making it a favorite among those seeking serenity and spiritual enlightenment. Sapphire's allure extends beyond its classic blue shade, with rare and prized variations in pink, yellow, and even colorless known as white sapphire. Whether set in a regal tiara or a delicate pendant, sapphire's timeless elegance and profound symbolism make it a treasure to cherish for generations to come.",
    "wikiImage": "https://gemstoneguru.com/wp-content/uploads/2013/05/Sapphire_32_Blue_Sapphire.png"
  },
  {
    "name": "Topaz",
    "description": "Topaz, a gemstone of stunning beauty and mystique, captivates with its radiant colors and remarkable clarity. With hues ranging from warm golden yellows to vibrant blues and pinks, topaz is a gemstone that exudes brilliance and elegance. Known as the stone of true love and success in all endeavors, topaz is believed to bring abundance, prosperity, and good fortune to its wearer. Its vibrant colors are reminiscent of the golden rays of the sun, infusing the spirit with warmth and optimism. Topaz is also associated with healing and rejuvenation, promoting emotional well-being and mental clarity. This gemstone has adorned the jewelry of ancient civilizations and continues to be cherished for its timeless beauty and powerful metaphysical properties. Whether worn as a statement piece or as a symbol of personal transformation, topaz is a gemstone that embodies the essence of luxury and enchantment.",
    "wikiImage": "https://media.istockphoto.com/id/187095424/photo/raw-unpolished-citrine-gemstones-on-the-white-background.jpg?s=612x612&w=0&k=20&c=X7rGhDRmb8nvGWTRoyIsJru9VMIvM3wZFrj2dmMBPes="
  },
  {
    "name": "Garnet",
    "description": "Garnet, a mesmerizing gemstone known for its deep red hues, enchants with its intense beauty and rich symbolism. Its name is derived from the Latin word Ggranatum, meaning pomegranate, due to its resemblance to the vibrant red seeds of the fruit. With a history that spans across civilizations, garnet has been revered as a talisman of protection, strength, and vitality. It is believed to inspire love, devotion, and passion while promoting positive energy and balance. The fiery red color of garnet evokes a sense of power and courage, igniting the spark of creativity and fueling the pursuit of dreams. As a symbol of friendship and trust, garnet is often exchanged as a gift to foster lasting connections and deepen bonds. Whether worn as a dazzling piece of jewelry or kept close as a precious gem, garnet is a stone that radiates warmth, passion, and a zest for life.",
    "wikiImage": "https://i.ebayimg.com/images/g/DdcAAOSwhhdj1R3h/s-l1200.webp"
  },
  {
    "name": "Opal",
    "description": "Opal, a mesmerizing gemstone that displays a play of vibrant colors, is truly a wonder of nature. Known for its iridescence, opal captivates with its shifting hues that seem to dance and shimmer in the light. It is a gemstone that exudes a sense of mystery and magic. Opal's beauty lies in its unique ability to reflect a multitude of colors, ranging from fiery reds and oranges to shimmering blues and greens. Its play of colors is often compared to a kaleidoscope, evoking a sense of joy and enchantment. Opal has been cherished throughout history for its believed metaphysical properties, such as enhancing creativity, inspiration, and imagination. It is thought to promote emotional well-being, bringing about feelings of hope, love, and happiness. Opal is a gemstone that invites exploration and reveals its true magnificence when admired up close, showcasing a captivating display of nature's artistry.",
    "wikiImage": "https://www.parlegems.com/images/static/content/gemlore/Doublet/M-DBT-AAI_sq.png"
  },
  {
    "name": "Pearl",
    "description": "Pearl, the epitome of elegance and grace, is a precious gem formed within the depths of the ocean. It is a natural treasure created by oysters in response to an irritant, layer by layer, over many years. Pearls possess a timeless beauty that radiates purity and sophistication. Their lustrous surfaces reflect light, casting a gentle glow that enhances the wearer's beauty. Pearls come in a range of colors, from the classic creamy white to shades of pink, silver, and black, each with its own allure. These exquisite gems have long been associated with purity, wisdom, and femininity, making them a symbol of elegance and refinement. Wearing pearls is believed to bring a sense of calmness and balance, promoting harmony and emotional well-being. A strand of pearls is a timeless accessory, cherished for its ability to enhance any outfit, from casual to formal, with its subtle charm. Pearls, the only gemstone created by living creatures, hold a unique place in the world of gemstones, embodying the natural beauty and allure of the ocean.",
    "wikiImage": "https://cdn.shopify.com/s/files/1/0577/0221/9938/products/2019-Fine-Pearl-Jewelry-Set-AAAA-8-9mm-Pearls-High-Quality-Pendant-Necklace-Earrings-Ring-for.jpg?v=1626097149"
  },
  {
    "name": "Onyx",
    "description": "Onyx, a mesmerizing gemstone, captivates with its deep and intense black color. It exudes a sense of mystery and sophistication, making it a sought-after choice for jewelry. Onyx is a type of chalcedony formed in the voids of lava flows, slowly solidifying into a striking black gemstone. Its smooth, polished surface showcases a velvety sheen, adding an aura of elegance to any piece. Known for its grounding properties, onyx is believed to provide strength and stability during challenging times. It is said to absorb negative energy and promote emotional balance, fostering inner strength and resilience. The sleek black hue of onyx allows it to pair beautifully with other gemstones and metals, creating striking contrasts and unique jewelry designs. Whether worn as a statement ring, pendant, or bracelet, onyx adds a touch of sophistication and allure to any outfit. Its timeless appeal and bold presence make onyx a versatile gemstone, perfect for both formal occasions and everyday wear.",
    "wikiImage": "https://quickbutik.imgix.net/22058c/products/63483c443cd56.jpeg"
  },
  {
    "name": "Malachite",
    "description": "Malachite, a captivating green gemstone, is renowned for its unique patterns and vibrant color. It is formed through the intricate interplay of copper minerals and atmospheric carbon dioxide. With its distinct banded patterns resembling swirling brushstrokes, malachite is often referred to as the Stone of Transformation. It is believed to bring positive energy, healing, and protection to those who wear or keep it nearby. The rich green hues of malachite evoke a connection with nature and symbolize growth, abundance, and renewal. Its mesmerizing beauty has made it a popular choice for jewelry and decorative objects throughout history. Malachite's unique patterns and varying shades of green make each piece truly one-of-a-kind. Whether worn as a pendant, earrings, or a statement ring, malachite adds a touch of natural beauty and elegance to any ensemble. Its powerful energy and striking appearance make it a favorite among gemstone enthusiasts and collectors alike.",
    "wikiImage": "https://media.istockphoto.com/id/174530453/photo/malachite.jpg?s=612x612&w=0&k=20&c=gBEBWYhwXuA1HHptQMx7zMaI8Cl9qFb6jS84B7Lwjyg="
  },
  {
    "name": "Turquoise",
    "description": "Turquoise, a stunning blue-green gemstone, has captivated civilizations for centuries with its vibrant color and unique properties. Formed through the intricate process of water interacting with copper and aluminum minerals, turquoise is celebrated for its distinctive hue that ranges from sky blue to deep green. It has been revered by many cultures as a sacred stone, symbolizing wisdom, protection, and good fortune. With its smooth texture and captivating color, turquoise has been used in jewelry and adornments for thousands of years. It is believed to possess healing and balancing properties, promoting emotional well-being and enhancing communication. Turquoise is also cherished for its cultural significance, often being associated with Native American jewelry and artwork. Its natural beauty and rich history make it a sought-after gemstone for both its aesthetic appeal and spiritual connections. Whether worn as a pendant, bracelet, or set in a statement ring, turquoise adds a touch of elegance and a pop of color to any jewelry collection.",
    "wikiImage": "https://tinyrituals.co/cdn/shop/articles/Untitled_design_-_2020-06-24T114744.664_1024x1024.jpg?v=1606377280"
  },
  {
    "name": "Azurite",
    "description": "Azurite, an enchanting deep blue mineral, is a gemstone that has fascinated people for centuries. Its striking color, reminiscent of the deep blue of the ocean or the vastness of the sky, makes it a favorite among collectors and jewelry enthusiasts. Azurite is formed through the oxidation of copper deposits, resulting in the creation of exquisite crystal formations. Its vibrant blue hue, often accompanied by streaks of green and black, creates a captivating visual appeal. This gemstone has long been associated with spiritual and metaphysical properties, believed to enhance intuition, insight, and clarity of thought. Its deep blue color is said to resonate with the energy of the third eye chakra, promoting inner vision and spiritual awareness. Azurite is also prized for its rich historical significance, having been used as a pigment in ancient artwork and as a stone of adornment in jewelry throughout the ages. Its beauty and metaphysical properties make it a popular choice for those seeking a gemstone with both aesthetic and spiritual qualities.",
    "wikiImage": "https://cdn11.bigcommerce.com/s-74zp6w28re/images/stencil/1280x1280/products/8296/91634/new-moon-beginnings-azurite-malachite-tumbled-stone-grade-a-cts-aa607__49094.1648804740.jpg?c=1"
  },
  {
    "name": "Hematite",
    "description": "Hematite, a captivating metallic mineral, is known for its lustrous silver-gray appearance and remarkable iron content. Its name is derived from the Greek word Haima, meaning blood, due to the deep red streaks often observed when the mineral is scratched on a surface. Hematite is composed mainly of iron oxide and is one of the most abundant minerals on Earth. Its dense and heavy nature gives it a substantial feel and makes it ideal for various practical applications. In addition to its industrial uses, Hematite is also highly regarded in the realm of crystal healing and metaphysical properties. It is believed to ground and protect the wearer, promoting a sense of stability and inner strength. Its reflective surface has been likened to a mirror, symbolizing self-reflection and introspection. Hematite is a mineral of balance, promoting harmony and equilibrium in life. Its alluring metallic sheen and rich symbolism make it a sought-after stone for both aesthetic and spiritual purposes.",
    "wikiImage": "https://cf.ltkcdn.net/feng-shui/images/orig/247627-2053x1461-hematite-stone.jpg"
  },
  {
    "name": "Pyrite",
    "description": "Pyrite, also known as Fool's Gold, is a dazzling mineral renowned for its metallic luster and golden hue. Its name is derived from the Greek word pyr, meaning fire, due to its ability to produce sparks when struck against another hard surface. Pyrite is composed of iron sulfide and is commonly found in sedimentary rocks and hydrothermal veins. Its distinct cubic crystal structure and brassy yellow color make it a captivating addition to mineral collections. Despite its resemblance to gold, Pyrite has no intrinsic value and is primarily used for its ornamental and decorative purposes. Pyrite is believed to possess protective and energizing properties, shielding against negative energy and promoting vitality. It is associated with abundance and prosperity, inspiring confidence and manifestation of goals. Its radiant appearance and enchanting qualities have made Pyrite a favorite among jewelry designers and metaphysical practitioners alike.",
    "wikiImage": "https://www.stonemania.co.uk/images/stories/virtuemart/product/iron-pyrite-mineral-yg.webp"
  },
  {
    "name": "Calcite",
    "description": "Calcite is a mineral found in various types of rocks, known for its stunning array of colors and intricate crystal structures. It belongs to the carbonate mineral group, with a chemical composition of calcium carbonate (CaCO3). This mineral is commonly found in limestone and marble formations, taking shape over extended periods of time. The crystals of calcite can exhibit different geometric forms, including rhombohedrons, scalenohedrons, and prisms. Under ultraviolet light, certain types of calcite display fluorescence, emitting a vibrant glow. Despite its beauty, calcite is relatively soft and can be easily scratched by harder minerals. Its versatile nature lends itself to various industrial applications, such as cement production, use as a filler in paper and plastics, and inclusion in paints and coatings.",
    "wikiImage": "https://t4.ftcdn.net/jpg/01/00/88/73/360_F_100887351_tTSYi44mm66cKmxQ7Bw40XronNCUzy8j.jpg"
  },
  {
    "name": "Fluorite",
    "description": "Fluorite, also known as fluorspar, is a fascinating mineral renowned for its vibrant colors and fluorescence under ultraviolet light. It is composed of calcium and fluorine, with a chemical formula of CaF2. The crystal structure of fluorite is often cubic, forming perfect octahedrons or cubes. Its colors range from transparent to various shades of purple, blue, green, yellow, and even colorless. The unique property of fluorescence sets fluorite apart, as it can emit a striking glow when exposed to UV light. This mineral is commonly found in hydrothermal veins, often associated with minerals like quartz and calcite. Fluorite has a relatively low hardness, making it susceptible to scratches, but its lustrous appearance makes it a popular choice for gemstone enthusiasts. In addition to its aesthetic appeal, fluorite has several industrial uses, including as a flux in metal smelting, a source of fluorine for manufacturing various products, and as a decorative stone in jewelry and carvings.",
    "wikiImage": "https://cdn11.bigcommerce.com/s-74zp6w28re/images/stencil/1280x1280/products/6103/36658/new-moon-beginnings-raw-green-fluorite-crystal-crr-aa493__85979.1635554300.jpg?c=1"
  },
  {
    "name": "Amazonite",
    "description": "Amazonite is an enchanting rock that showcases a captivating blend of green and blue hues. It belongs to the feldspar family and is composed primarily of potassium, aluminum, silicon, and oxygen. Its name is derived from the Amazon River, although it is not exclusively found in the Amazon region. The mesmerizing color of Amazonite ranges from a pale green to a deep turquoise, reminiscent of lush tropical forests and serene ocean waters. This stone is renowned for its opaque and vitreous appearance, which lends it a unique charm. Amazonite is typically found in granite and pegmatite formations, and some notable deposits exist in Brazil, Russia, and the United States. It is cherished not only for its aesthetic beauty but also for its believed metaphysical properties. Amazonite is associated with soothing and calming energies, promoting emotional balance, harmony, and clear communication. Whether adorning jewelry or used as decorative pieces, Amazonite's captivating color and metaphysical allure make it a cherished gemstone among collectors and enthusiasts.",
    "wikiImage": "https://m.media-amazon.com/images/I/61ZcqU+lK-L._AC_UF894,1000_QL80_.jpg"
  },
  {
    "name": "Labradorite",
    "description": "Labradorite is a mesmerizing and iridescent rock that exhibits a stunning play of colors. It belongs to the feldspar mineral group and is composed of calcium, sodium, and aluminum. Known for its unique optical properties, Labradorite displays a captivating phenomenon called labradorescence, where it reflects vibrant flashes of blue, green, yellow, and purple when viewed from different angles. This iridescent effect gives Labradorite an otherworldly and mystical allure. The stone was named after the Labrador Peninsula in Canada, where it was first discovered. Labradorite is commonly found in igneous rocks such as basalt and gabbro, and it is also mined in various other countries including Madagascar, Finland, and Russia. In addition to its breathtaking appearance, Labradorite is believed to possess metaphysical properties. It is associated with transformation, intuition, and spiritual awakening, making it a popular stone among those seeking spiritual growth and protection. Whether used in jewelry or as decorative pieces, Labradorite's captivating colors and metaphysical significance make it a cherished gemstone in the world of crystals and minerals.",
    "wikiImage": "https://assets1.fossilera.com/sp/350721/labradorite/labradorite.jpg"
  },
  {
    "name": "Tiger's Eye",
    "description": "Tiger's Eye is a mesmerizing and unique gemstone known for its striking golden-brown color and distinctive chatoyancy, which gives it a shimmering effect reminiscent of a tiger's eye. This beautiful stone is a member of the quartz family and is formed through a combination of quartz, iron oxide, and other mineral deposits. The name Tiger's Eye is derived from its resemblance to the eye of a tiger, with its golden hues and silky luster. It is often associated with strength, courage, and protection, and is believed to enhance one's willpower and determination. Tiger's Eye is also considered a stone of balance and harmony, helping to bring stability and clarity to the mind. It is said to promote confidence and self-esteem, making it a popular choice for individuals seeking empowerment and self-improvement. Additionally, Tiger's Eye is believed to have grounding and protective properties, shielding its wearer from negative energies and promoting a sense of inner strength and resilience. Its captivating beauty and powerful metaphysical properties make Tiger's Eye a sought-after gemstone for both jewelry and spiritual purposes.",
    "wikiImage": "https://brooklyncharm.com/wp-content/uploads/2017/09/tigers-eye-polished-rocks-and-pebbles-30-grams-ns841-59e7bb75.jpg"
  },
  {
    "name": "Beryl",
    "description": "Beryl is a fascinating gemstone that comes in a variety of colors, including green, blue, yellow, and pink. It is a mineral composed of beryllium aluminum cyclosilicate and belongs to the family of silicate minerals. Beryl is known for its excellent transparency and brilliance, making it highly valued in the gemstone industry. The most famous variety of beryl is the emerald, prized for its vivid green color. Another well-known variety is aquamarine, which exhibits a beautiful blue hue reminiscent of the sea. Beryl is also found in other color varieties such as heliodor (yellow), morganite (pink), and golden beryl (yellowish-brown). This gemstone is known for its durability and hardness, ranking 7.5 to 8 on the Mohs scale. Beryl has been revered for its beauty and symbolic significance for centuries. It is believed to bring courage, creativity, and good fortune to its wearer. The different colors of beryl are associated with various qualities, such as tranquility, clarity, and inspiration. Overall, beryl is a captivating gemstone with a rich history and a wide range of stunning colors that make it highly desirable in both the jewelry and collector's market.",
    "wikiImage": "https://img.freepik.com/premium-photo/macro-mineral-stone-fluorite-white-background_254845-24458.jpg"
  },
  {
    "name": "Citrine",
    "description": "Citrine is a vibrant and radiant gemstone known for its warm golden to yellowish-brown color. It is a variety of quartz that derives its hue from traces of iron in its crystal structure. Citrine is often associated with abundance, joy, and positivity, earning it the nickname The Merchant's Stone for its believed ability to attract wealth and success. Its sunny and uplifting color is reminiscent of the sun, making it a popular choice for jewelry. Citrine is believed to carry the energy of the sun, promoting vitality, confidence, and self-expression. This gemstone is also associated with clarity of mind and creativity, stimulating the imagination and enhancing focus. Citrine is relatively abundant and can be found in various parts of the world, including Brazil, Madagascar, and the United States. Its affordability, durability (7 on the Mohs scale), and appealing color make it a sought-after gemstone for both jewelry enthusiasts and collectors. Whether worn as a jewelry piece or kept as a crystal, citrine brings a touch of warmth, positivity, and abundance into one's life.",
    "wikiImage": "https://crystaldreamsworld.com/wp-content/uploads/2020/05/Aura-Quartz-citrine3-scaled.jpg"
  },
  {
    "name": "Tourmaline",
    "description": "Tourmaline is a fascinating gemstone known for its wide range of colors, including shades of green, pink, blue, yellow, and black. It is a complex mineral group that comprises several distinct species, each with its own unique properties. Tourmaline crystals can display a remarkable variation in color within a single specimen, often referred to as Watermelon tourmaline due to its green outer layer and pink or red core. This gemstone is prized for its vibrant hues, exceptional clarity, and interesting crystal formations. Tourmaline is known to possess strong metaphysical properties, promoting a sense of grounding, protection, and balance. It is believed to enhance one's energy flow, clear negative influences, and stimulate creativity and intuition. Tourmaline is found in various locations around the world, including Brazil, Afghanistan, and Madagascar, with each region producing its own distinct colors and varieties. Due to its versatile color range and metaphysical properties, tourmaline is highly valued in the world of gemstones and jewelry. Whether used as a centerpiece in a necklace, a striking gem in a ring, or a polished crystal for spiritual purposes, tourmaline captivates with its mesmerizing beauty and energetic properties.",
    "wikiImage": "https://i5.walmartimages.com/asr/95157901-9e1b-45b6-a23b-a766e1d764ff_1.85160686b8395c5108baa75aff7d8293.jpeghttps://i5.walmartimages.com/asr/95157901-9e1b-45b6-a23b-a766e1d764ff_1.85160686b8395c5108baa75aff7d8293.jpeg"
  },
  {
    "name": "Rhodonite",
    "description": "Tourmaline is a fascinating gemstone known for its wide range of colors, including shades of green, pink, blue, yellow, and black. It is a complex mineral group that comprises several distinct species, each with its own unique properties. Tourmaline crystals can display a remarkable variation in color within a single specimen, often referred to as Watermelon tourmaline due to its green outer layer and pink or red core. This gemstone is prized for its vibrant hues, exceptional clarity, and interesting crystal formations. Tourmaline is known to possess strong metaphysical properties, promoting a sense of grounding, protection, and balance. It is believed to enhance one's energy flow, clear negative influences, and stimulate creativity and intuition. Tourmaline is found in various locations around the world, including Brazil, Afghanistan, and Madagascar, with each region producing its own distinct colors and varieties. Due to its versatile color range and metaphysical properties, tourmaline is highly valued in the world of gemstones and jewelry. Whether used as a centerpiece in a necklace, a striking gem in a ring, or a polished crystal for spiritual purposes, tourmaline captivates with its mesmerizing beauty and energetic properties.",
    "wikiImage": "https://www.rocktreasureswholesale.com/images/product_images/popup_images/65312_0.jpg"
  },
  {
    "name": "Selenite",
    "description": "Selenite is a remarkable mineral with a unique translucent appearance. It is a form of gypsum, composed of hydrous calcium sulfate. The name Selenite is derived from the Greek word for Moon, due to its moon-like glow and the way it reflects light. This gemstone is known for its delicate and ethereal beauty, often appearing in pristine white or colorless crystals. Selenite has a soft and fibrous texture that gives it a shimmering and pearlescent effect. It is often found in large, transparent crystals or in smaller, tabular formations. Selenite is highly valued for its spiritual and metaphysical properties. It is believed to possess a calming and soothing energy, promoting mental clarity and emotional healing. Selenite is associated with the crown chakra, representing higher consciousness and spiritual awareness. It is used in crystal healing practices to cleanse and purify the aura, as well as to enhance meditation and spiritual connection. Selenite is commonly found in locations such as Mexico, Morocco, and the United States. Its delicate appearance and powerful energetic properties make selenite a sought-after gemstone for both collectors and spiritual enthusiasts.",
    "wikiImage": "https://www.minerals-kingdom.com/wp-content/uploads/2015/06/selenite-stone.jpg"
  },
  {
    "name": "Ammonite",
    "description": "Ammonite is a fascinating fossilized rock that once existed as the shells of ancient marine creatures called ammonoids. These creatures lived in the oceans millions of years ago and went extinct around the same time as the dinosaurs. Ammonite fossils are renowned for their spiral-shaped shells, which resemble tightly coiled nautilus shells. The intricate patterns and vibrant colors found on ammonite fossils make them highly prized by collectors and enthusiasts. These fossils are composed primarily of aragonite, a mineral form of calcium carbonate. Ammonite fossils provide valuable insights into Earth's history and the evolution of marine life. They are often used as index fossils, helping geologists determine the age of rock layers and establish geological timelines. Ammonites can range in size from a few centimeters to several meters in diameter, with some of the largest specimens found in Madagascar. The colorful and iridescent appearance of ammonite fossils is a result of mineral replacement and can vary greatly depending on the location and preservation process. These fossils are not only scientifically significant but also hold spiritual and metaphysical symbolism in various cultures. Ammonites are believed to symbolize change, growth, and protection, and they are often used as decorative pieces and in jewelry designs.",
    "wikiImage": "https://assets1.fossilera.com/sp/455076/morocco/unidentified.jpg"
  },
  {
    "name": "Celestite",
    "description": "Celestite, also known as Celestine, is a captivating mineral that showcases stunning sky-blue or pale blue coloration. It is composed of strontium sulfate and is often found in geodes or crystal clusters. Celestite derives its name from the Latin word Caelestis, meaning celestial or heavenly, due to its ethereal blue color reminiscent of the sky. This mineral is renowned for its unique crystal formations, which can be elongated, tabular, or prismatic in shape. The crystals often exhibit a beautiful translucency or transparency. Celestite is prized for its calming and soothing energy, believed to promote relaxation and peacefulness. It is associated with the throat chakra and is said to enhance communication, intuition, and spiritual connection. Celestite is found in various locations around the world, including Madagascar, Mexico, and the United States. It is often used in metaphysical practices, meditation, and crystal healing. Some believe that Celestite has metaphysical properties that can aid in stress relief, balancing emotions, and promoting a sense of tranquility. It is also valued for its aesthetic appeal and is used in jewelry and decorative objects.",
    "wikiImage": "https://trulyexperiences.com/blog/wp-content/uploads/2021/09/celestite-crystal-scaled.jpeg"
  },
  {
    "name": "Rhodochrosite",
    "description": "Rhodochrosite is a captivating gemstone renowned for its vibrant pink to red coloration, often displaying bands or swirls of lighter and darker shades. It belongs to the carbonate mineral group and is composed of manganese carbonate. This beautiful gemstone is prized for its exceptional beauty and is often used in jewelry and ornamental objects. Rhodochrosite is known for its distinct and eye-catching patterns, which can resemble delicate floral designs or captivating landscapes. It is associated with the heart chakra and is believed to promote love, compassion, and emotional healing. The stone is highly sought after for its metaphysical properties, said to help release emotional blockages, enhance self-love, and foster a positive outlook. Rhodochrosite is found in various locations around the world, including Argentina, Peru, and the United States. It is often treasured as a collector's gemstone due to its rarity and unique appearance. The stone's vibrant color and intricate patterns make it a popular choice for statement jewelry pieces and decorative items",
    "wikiImage": "https://i.etsystatic.com/9859922/r/il/937f64/4898016246/il_fullxfull.4898016246_11wx.jpg"
  }
]
