[
  {
    "name": "Granite",
    "description": "Granite is a captivating igneous rock known for its durability and elegant beauty. Composed of quartz, feldspar, and mica minerals, Granite showcases a coarse-grained texture that weaves a mesmerizing tapestry of colors and patterns. From pristine whites to obsidian blacks, Granite's vast spectrum of hues ignites the imagination and senses. Its origin lies deep within the Earth's crust, where molten magma slowly cools and solidifies, resulting in a rock of unparalleled endurance. Embrace the remarkable versatility of Granite as it adorns construction and design projects with grace and refinement. It is the coveted choice for luxurious countertops, exquisite flooring, and awe-inspiring building facades, transforming ordinary spaces into extraordinary works of art. Marvel at Granite's artistry as it leaves an indelible mark on monuments and sculptural masterpieces. Discover the captivating world of Granite through our website and embark on a journey of fascination, discovery, and appreciation for the magnificent wonders of our planet.",
    "wikiImage": "https://images.schoolspecialty.com/images/586255_ecommfullsize.jpg",
    "type": "Igneous",
    "features": [
      "Enchanting interplay of minerals",
      "Spellbinding tapestry of colors and patterns",
      "Unparalleled durability and endurance",
      "Versatile adornment for construction and design",
      "Coveted choice for luxurious spaces",
      "Breathes life into architectural wonders",
      "Leaves an indelible mark on monuments and sculptures",
      "Heat and stain resistant for practical functionality",
      "Low maintenance and easy to clean",
      "Adds timeless elegance to any space"
    ]
  },

  {
    "name": "Basalt",
    "description": "Basalt is a durable and fine-grained igneous rock formed from the rapid cooling of lava near the Earth's surface. Composed primarily of pyroxene, plagioclase feldspar, and olivine, Basalt exhibits a dense and durable composition. With its dark gray to black color range, Basalt emanates a sense of timeless elegance. This versatile rock is highly sought after in the construction industry for its exceptional strength and resistance to weathering. It is commonly used in the production of crushed stone, concrete aggregates, and asphalt for road construction, ensuring the durability and longevity of infrastructure projects. Beyond construction, Basalt's aesthetic appeal has made it a popular choice for creating exquisite statues, sculptures, and jewelry, showcasing its natural beauty and enhancing artistic expressions. Explore the captivating world of Basalt through our website and discover its remarkable qualities, from its enduring strength to its distinctive visual allure.",
    "wikiImage": "https://outforia.com/wp-content/uploads/2021/07/Types-of-rocks-basalt-0721.jpg",
    "type": "Igneous",
    "features": [
      "Durable and fine-grained composition",
      "Dark gray to black color range",
      "Highly resistant to weathering",
      "Used in the construction of roads and buildings",
      "Ideal for creating artistic statues and sculptures",
      "Popular choice for jewelry and decorative items",
      "Forms fascinating geological formations",
      "Provides excellent thermal insulation",
      "Abundant availability worldwide",
      "Enhances sound insulation properties"
    ]
  }
]
