[
  {
    "id": 1,
    "topic": "The Earth's age is approximately 4.5 billion years.",
    "description": "Earth is estimated to be 4.54 billion years old, plus or minus about 50 million years. Scientists have scoured the Earth searching for the oldest rocks to radiometrically date. In northwestern Canada, they discovered rocks about 4.03 billion years old. Then, in Australia, they discovered minerals about 4.3 billion years old. Researchers know that rocks are continuously recycling, due to the rock cycle, so they continued to search for data elsewhere. Since it is thought the bodies in the solar system may have formed at similar times, scientists analyzed moon rocks collected during the moon landing and even meteorites that have crash-landed on Earth. Both of these materials dated to between 4.4 and 4.5 billion years.",
    "img": "https://earthsky.org/upl/2021/06/earth-rotation-NASA-EPIC.gif"
  },
  {
    "id": 2,
    "topic": "Plate tectonics is the scientific theory that explains the movement of the Earth's lithosphere.",
    "description": "Plate tectonics is the scientific theory that explains the movement of the Earth's rigid tectonic plates. These plates float on the semi-fluid layer beneath them and are driven by convection currents in the Earth's mantle. Plate boundaries are classified as divergent (plates move apart), convergent (plates collide), or transform (plates slide past each other). Plate tectonics is responsible for earthquakes, volcanic activity, mountain formation, and the arrangement of continents and ocean basins. It is a fundamental concept in geology, revolutionizing our understanding of Earth's dynamic processes.",
    "img": "https://res.cloudinary.com/dk-find-out/image/upload/q_80,w_1920,f_auto/AW_DD125_WorldPlates_tvpdp0.jpg"
  },
  {
    "id": 3,
    "topic": "The Earth's core consists of a solid inner core and a liquid outer core.",
    "description": "The Earth's core consists of a solid inner core and a liquid outer core. The solid inner core is primarily composed of iron and nickel, while the liquid outer core is also rich in these elements. The core plays a crucial role in generating Earth's magnetic field and influencing geologic processes such as plate tectonics and volcanism. It is a subject of ongoing scientific research to further understand its properties and behavior.",
    "img": "https://scx2.b-cdn.net/gfx/news/2015/earthssurpri.jpg"
  },
  {
    "id": 4,
    "topic": "The Mohorovičić discontinuity, or Moho, is the boundary between the Earth's crust and the mantle.",
    "description": "The Mohorovičić discontinuity, commonly known as the Moho, marks the boundary between the Earth's crust and the underlying mantle. It is a significant geological interface where there is a distinct change in composition and physical properties. The Moho plays a vital role in understanding the structure and dynamics of the Earth's lithosphere and is a subject of study in geophysics and seismology.",
    "img": "https://geology.com/articles/images/moho-mohorovicic.gif"
  },
  {
    "id": 5,
    "topic": "The three major types of rocks are igneous, sedimentary, and metamorphic.",
    "description": "The three major types of rocks are igneous, sedimentary, and metamorphic. These rock types are formed through different geological processes. Igneous rocks are formed from the solidification of molten magma or lava. Sedimentary rocks are created through the accumulation and cementation of sediments, such as sand, silt, and organic matter. Metamorphic rocks are formed when existing rocks undergo changes in their composition and texture due to high temperatures and pressures. Understanding these rock types provides insights into Earth's history and the processes that shape its surface.",
    "img": "https://fileserver.teachstarter.com/thumbnails/2306-types-rocks-posters-us-thumbnail-0-600x400.png"
  },
  {
    "id": 6,
    "topic": "Granite is a common type of igneous rock found in continental crust.",
    "description": "Granite is a prevalent type of igneous rock predominantly found in the continental crust. It is composed of interlocking mineral crystals, primarily feldspar, quartz, and mica. Granite forms deep underground through the slow cooling and solidification of magma. It is known for its durability, strength, and attractive appearance, making it a popular material in construction, countertops, and decorative applications.",
    "img": "https://www.geologypage.com/wp-content/uploads/2019/05/Granite-Rocks-GeologyPage.jpg"
  },
  {
    "id": 7,
    "topic": "The rock cycle describes the continuous transformation of rocks from one type to another over time.",
    "description": "The rock cycle describes the continuous transformation of rocks from one type to another over time. It encompasses the processes through which rocks can be formed, broken down, and changed into different types. This cycle involves various geological processes, including weathering, erosion, deposition, compaction, and cementation. Rocks can undergo metamorphism, melting, cooling, and crystallization, leading to the formation of igneous, sedimentary, and metamorphic rocks. The rock cycle is an essential concept in geology, highlighting the dynamic nature of Earth's crust and the interconnectedness of different rock types.",
    "img": "https://opentextbc.ca/physicalgeologyearle/wp-content/uploads/sites/145/2016/06/rock-cycle2.png"
  },
  {
    "id": 8,
    "topic": "Fossils are the preserved remains or traces of ancient organisms found in rocks.",
    "description": "Fossils are the preserved remains or traces of ancient organisms found in rocks. They provide valuable insights into the history of life on Earth and the processes of evolution. Fossils can include the actual remains of organisms, such as bones, shells, or teeth, as well as indirect evidence like imprints, tracks, or burrows. Through the study of fossils, scientists can reconstruct past ecosystems, understand evolutionary relationships, and document the existence of species that have long been extinct. Fossils are typically found in sedimentary rocks, where the conditions for preservation are optimal.",
    "img": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgNeUQzpu2DGFM_Zknwefrcton3xhbSSUqAGidTSZY_5H-weDu6nD9MWOiOp0wyidvqgx-ehxcAFC25jSfmQanfjbOLSwBFCg-YcoF8D8KYVLVM46Kbul6DWZOX5EFL8wAmm8k79FMgov0tbmc-KQbwSIjDwv_qZfnlbTzBHFA0-jFMQpnepqs3EXMT/s1244/Fossil%20fishing%20at%20the%20farm!%20Stunningly%20well-preserved%20remains%20(1).jpg"
  },
  {
    "id": 9,
    "topic": "The study of past climates using geological evidence is known as paleoclimatology.",
    "description": "Paleoclimatology is the study of past climates using geological evidence. It involves examining various geological records to reconstruct and understand past climate conditions. Scientists analyze sources such as ice cores, sediment layers, tree rings, and fossil records to gather information about temperature patterns, precipitation levels, atmospheric composition, and other climate indicators. By studying these records, paleoclimatologists can gain insights into long-term climate changes, natural climate variability, the impact of human activities on climate, and the mechanisms driving climate processes over geological timescales.",
    "img": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5f/All_palaeotemps.svg/600px-All_palaeotemps.svg.png"
  },
  {
    "id": 10,
    "topic": "Earthquakes occur when there is a sudden release of energy in the Earth's crust, resulting in seismic waves.",
    "description": "Earthquakes occur when there is a sudden release of energy in the Earth's crust, resulting in seismic waves. Most earthquakes are caused by the movement of tectonic plates, which make up Earth's rigid outer shell. When stress accumulates along plate boundaries or faults, it eventually overcomes the strength of the rocks, leading to sudden slippage and the release of energy in the form of seismic waves. These waves radiate outwards from the earthquake's focus, causing the ground to shake and potentially resulting in damage to structures and landscapes. Earthquakes can also be triggered by volcanic activity, human-induced activities like mining or reservoir-induced seismicity, or even by the movement of magma beneath the Earth's surface.",
    "img": "https://aliensguidebookofearth.weebly.com/uploads/5/3/8/0/53809113/276932617.jpg?412"
  },
  {
    "id": 11,
    "topic": "Volcanoes are formed when molten rock, or magma, rises to the Earth's surface.",
    "description": "Volcanoes are formed when molten rock, or magma, rises to the Earth's surface. Volcanic activity occurs at locations where there are openings in the Earth's crust, such as divergent plate boundaries, convergent plate boundaries, or hotspots. When magma reaches the surface, it erupts, often accompanied by gases and ash. This eruption creates various volcanic landforms, such as mountains, cones, craters, and lava flows. Volcanoes are not only remarkable geological features but also play a significant role in shaping landscapes, influencing climate patterns, and contributing to the formation of new land through lava deposition.",
    "img": "https://d9-wret.s3.us-west-2.amazonaws.com/assets/palladium/production/s3fs-public/styles/side_image/public/vhp_img5738.png?itok=9KiJbs3T"
  },
  {
    "id": 12,
    "topic": "The Ring of Fire is a major area in the basin of the Pacific Ocean where many earthquakes and volcanic eruptions occur.",
    "description": "The Ring of Fire is a major area in the basin of the Pacific Ocean where many earthquakes and volcanic eruptions occur. It forms a horseshoe-shaped region and is associated with a large number of tectonic plate boundaries. The Ring of Fire stretches along the coasts of several continents, including the Pacific coasts of North and South America, Asia, and Oceania. This region is characterized by intense seismic and volcanic activity due to the subduction of oceanic plates beneath continental plates and the collision of tectonic plates. The high concentration of earthquakes and volcanic eruptions in the Ring of Fire makes it a geologically active and dynamic area.",
    "img": "https://cdn.britannica.com/57/5457-050-40B0E740/ring-volcanoes-arcs-tectonic-plate-boundaries-Pacific.jpg"
  },
  {
    "id": 13,
    "topic": "Mountains are formed through tectonic forces, such as the collision of two continental plates.",
    "description": "Mountains are formed through tectonic forces, such as the collision of two continental plates. These forces cause the Earth's crust to undergo deformation, resulting in the uplift and formation of large landforms with significant elevation and steep slopes. Mountain-building processes involve compression, folding, faulting, and uplift. Over millions of years, as the tectonic forces act upon the Earth's crust, mountains can be formed through various mechanisms, including the folding and buckling of rock layers, the uplift of large fault blocks, or the accumulation of volcanic materials. Mountains are not only impressive physical features but also play crucial roles in shaping climates, influencing water systems, and providing habitats for diverse ecosystems.",
    "img": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTHsJNUI17oKfYc9xDbWxFEbvlMV7YGFGri0m07zJlHjyGqHNvfDY7mTXzS5raTdT4G_ng&usqp=CAU"
  },
  {
    "id": 14,
    "topic": "The Himalayas, including Mount Everest, are the result of the collision between the Indian and Eurasian plates.",
    "description": "The Himalayas, including Mount Everest, are the result of the ongoing collision between the Indian and Eurasian plates. This collision began around 50 million years ago and continues today. The immense forces generated by the convergence of these two continental plates have led to the uplift and formation of the Himalayan mountain range. The Himalayas, known as the 'roof of the world', are home to some of the highest peaks on Earth, including Mount Everest, which stands as the tallest mountain. This majestic mountain range showcases the remarkable geological processes involved in plate tectonics and serves as an iconic symbol of Earth's dynamic nature.",
    "img": "https://www.geolsoc.org.uk/~/media/shared/images/education%20careers/KS4/india%20migration.JPG?h=420&w=228&la=en"
  },
  {
    "id": 15,
    "topic": "The Grand Canyon in Arizona, USA, was carved by the Colorado River over millions of years.",
    "description": "The Grand Canyon in Arizona, USA, was carved by the Colorado River over millions of years. This iconic natural wonder exhibits the power of erosion and the gradual shaping of landscapes. The Colorado River, aided by other erosional forces such as wind and weathering, has carved out the deep and expansive canyon over an estimated period of 6 million years. The exposed rock layers within the canyon provide a geological record spanning millions of years, showcasing the Earth's history and the processes that have shaped its surface. The Grand Canyon stands as a testament to the immense geological forces and the persistence of natural processes over vast timescales.",
    "img": "https://a-z-animals.com/media/2022/03/shutterstock_97706066.jpg"
  },
  {
    "id": 16,
    "topic": "The Great Barrier Reef in Australia is the largest coral reef system in the world.",
    "description": "The Great Barrier Reef is the world’s largest coral reef system located in the Coral Sea off the shore of Queensland, northeastern Australia. It extends over a vast area of approximately 344,4000 sq. km and is is composed of over 2,900 individual reef systems, 760 fringe reefs, 300 coral rays and 900 islands that stretch over 2,300 km. The reef system is composed and built by billions of coral polyps and now supports a wide variety of marine life ranging from ancient sea turtles, reef fish and 134 species of sharks, 400 different hard and soft corals in addition to a plethora of seaweeds. The reef has also cultural significance, as it was used by the Aboriginal Australians and Torres Strait Islanders.",
    "img": "https://greatbarrierreef.org/wp-content/uploads/2022/06/Lady-Musgrave-Island-Great-Barrier-Reef.jpg"
  },
  {
    "id": 17,
    "topic": "Tsunamis are large ocean waves caused by underwater earthquakes or volcanic eruptions.",
    "description": "Tsunamis are a series of ocean waves caused by submarine earthquakes or volcanic eruptions. This means that they are secondary hazards. These tsunami waves travel through the ocean and can reach heights of over 30 metres on land. Earthquakes at convergent plate margins cause most tsunamis. Because of the movement from the earthquake, the seabed is displaced vertically. This, in turn, displaces the water column above. The speed of a tsunami depends on the depth of the ocean. As it approaches shallow water, the tsunami slows down and increases in height, making it very dangerous.It’s not just earthquakes that cause tsunamis – landslides and volcanic activity are also culprits!",
    "img": "https://www.australianenvironmentaleducation.com.au/wp-content/uploads/2020/08/Tsunami-graphic-v2.jpg"
  },
  {
    "id": 18,
    "topic": "The water cycle involves the continuous movement of water between the atmosphere, land, and oceans.",
    "description": "The water cycle, also known as the hydrological cycle, is the continuous circulation of water on Earth. It involves various processes, including evaporation, condensation, precipitation, and runoff. Water evaporates from bodies of water, such as oceans, lakes, and rivers, into the atmosphere, where it condenses to form clouds. Eventually, the condensed water droplets fall back to the Earth as precipitation, which can take the form of rain, snow, sleet, or hail. This water then flows into streams, rivers, and groundwater, replenishing water sources and supporting plant and animal life. The water cycle plays a crucial role in maintaining the Earth's water balance and sustaining ecosystems worldwide.",
    "img": "https://cdn.britannica.com/73/1473-050-D7FE3FD0/surface-hydrologic-cycle-water-values-oceans-land.jpg"
  },
  {
    "id": 19,
    "topic": "Groundwater is the water stored beneath the Earth's surface in aquifers.",
    "description": "GroundwaterGuard is a comprehensive component designed to enlighten users about the significance and characteristics of groundwater—a vital resource stored beneath the Earth's surface in aquifers. Through engaging content and interactive visuals, GroundwaterGuard provides a deep dive into the world of groundwater, covering its role in the water cycle, its importance for human and ecological needs, and the challenges associated with its management and sustainability. Explore the hidden world of groundwater with GroundwaterGuard and uncover the secrets that lie beneath our feet.",
    "img": "https://cdn.mos.cms.futurecdn.net/LSwaGChBCNMxZKr5DryM5j.jpg"
  },
  {
    "id": 20,
    "topic": "Karst landscapes, characterized by sinkholes and caves, are formed by the dissolution of soluble rocks such as limestone.",
    "description": "Karst landscapes are unique land areas characterized by limestone dissolution, resulting in caves, sinkholes, and underground streams. Rainwater slowly erodes the porous limestone, forming distinct features such as caves and steep cliffs. Shilin in China's South China Karst and the cenotes in Mexico's Yucatán Peninsula are notable examples of karst formations. Shilin, known as the stone forest, showcases tall rock formations resembling trees, while cenotes are karst sinkholes filled with water, offering refreshing swimming spots. Discover the wonders of karst landscapes, from China to Mexico.",
    "img": "https://qph.cf2.quoracdn.net/main-qimg-197753570e8d36d6ed133077e68eafe7-lq"
  },
  {
    "id": 21,
    "topic": "The Ozone layer is a region in the Earth's stratosphere that protects against harmful ultraviolet radiation.",
    "description": "The Ozone layer is a crucial region in the Earth's stratosphere that acts as a protective shield against harmful ultraviolet (UV) radiation from the sun. It is formed by a high concentration of ozone molecules, which absorb and block a significant portion of the UV rays. This protective barrier plays a vital role in safeguarding life on Earth by reducing the harmful effects of UV radiation, such as skin cancer, cataracts, and damage to ecosystems. The depletion of the Ozone layer, primarily caused by human activities releasing ozone-depleting substances, poses a significant environmental concern and has led to international efforts to mitigate further damage and promote its recovery.",
    "img": "https://www.teachengineering.org/content/cub_/lessons/cub_air/cub_air_lesson08_figure1new.png"
  },
  {
    "id": 22,
    "topic": "The magnetic field of the Earth is generated by the movement of molten iron in its outer core.",
    "description": "The Earth's magnetic field is created by the motion of liquid iron in its outer core. This molten iron flows due to heat generated by the Earth's internal processes, such as radioactive decay and residual heat from its formation. The movement of the liquid iron generates electric currents, which in turn generate a magnetic field. This magnetic field extends into space around the Earth and acts as a protective shield, deflecting harmful solar radiation and charged particles from the solar wind. The Earth's magnetic field is essential for navigation, as it helps compasses align and enables migratory animals to navigate. It also plays a vital role in studying the Earth's geology and understanding its internal structure.",
    "img": "https://earthsky.org/upl/2016/12/earth-magnetic-field.jpeg"
  },
  {
    "id": 23,
    "topic": " Geodes are hollow rocks with crystal formations inside.",
    "description": "Geodes are unique geological formations characterized by their hollow structure and beautiful crystal formations inside. They are typically round or oval-shaped rocks that have an outer layer made of solid rock or mineral material. Inside the geode, there is a hollow cavity lined with crystals such as quartz, amethyst, or calcite. The formation of geodes occurs over long periods of time as mineral-rich water seeps into rock cavities or gas bubbles, allowing crystals to slowly grow inside. Geodes are prized by collectors and enthusiasts for their natural beauty and the fascinating variety of crystal formations they contain.",
    "img": "https://img-aws.ehowcdn.com/877x500/contentlab-data.s3.amazonaws.com/getty%2F2d774bc274f34dfdbc7bc2a88e185433.jpg"
  },
  {
    "id": 24,
    "topic": "Diamonds are formed deep within the Earth's mantle under high pressure and temperature.",
    "description": "Diamonds are precious gemstones that form deep within the Earth's mantle, subjected to extreme conditions of high pressure and temperature. They are composed of carbon atoms arranged in a crystal lattice structure. Over millions of years, carbon-rich materials are exposed to intense heat and pressure, causing the carbon atoms to bond and form diamonds. Volcanic eruptions then bring these diamonds closer to the Earth's surface. The rarity and durability of diamonds, along with their brilliant optical properties, have made them highly valued for jewelry and industrial applications.",
    "img": "https://scitechdaily.com/images/Deep-Earth-Recycling.jpg"
  },
  {
    "id": 25,
    "topic": "The San Andreas Fault in California, USA, is a major transform boundary between the Pacific and North American plates",
    "description": "The San Andreas Fault in California, USA, is a significant geological feature that serves as a major transform boundary between the Pacific Plate and the North American Plate. It is a tectonic fault line characterized by horizontal sliding motion, where the two plates slide past each other horizontally. This dynamic interaction between the plates gives rise to frequent earthquakes and has shaped the landscape of California over millions of years. The San Andreas Fault is renowned for its role in plate tectonics and serves as a significant area of study for geologists and seismologists.",
    "img": "https://www.nps.gov/subjects/geology/images/san-andreas-transform-plate-boundary-10x.jpg"
  },
  {
    "id": 26,
    "topic": "The Andes Mountains in South America are the longest continental mountain range.",
    "description": "The Andes Mountains in South America are the world's longest continental mountain range. Stretching over 7,000 kilometers (4,300 miles), they extend along the western edge of the continent, spanning through several countries including Venezuela, Colombia, Ecuador, Peru, Bolivia, Chile, and Argentina. The Andes are known for their remarkable elevation and diverse landscapes, encompassing snow-capped peaks, deep valleys, glaciers, and high-altitude plateaus. They play a crucial role in shaping the climate, ecosystems, and cultures of the regions they traverse, making them a significant natural feature of South America.",
    "img": "https://www.adventurealternative.com/media/817234/andes-map.jpg?width=377&height=500"
  },
  {
    "id": 27,
    "topic": "The Sahara Desert in Africa is the largest hot desert in the world.",
    "description": "The Sahara Desert in Africa is the world's largest hot desert, covering a vast expanse of land across Northern Africa. It stretches over 9.2 million square kilometers (3.6 million square miles), making it comparable in size to the entire United States. The Sahara is characterized by its extreme aridity, with hot temperatures, minimal rainfall, and sparse vegetation. It is home to a diverse array of desert-adapted plants and animals, including camels, desert foxes, and unique desert-dwelling reptiles. The Sahara's iconic sand dunes, rocky plateaus, and expansive barren landscapes make it a remarkable natural wonder and a challenging environment to survive in.",
    "img": "https://www.thoughtco.com/thmb/l0Ei2qSYEp6vtU6a1o0FtphhV4s=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/SaharaDesert-58c1a5603df78c353c3d525d.jpg"
  },
  {
    "id": 28,
    "topic": "The Dead Sea, located between Jordan and Israel, is the lowest point on Earth's land surface.",
    "description": "The Ozone layer is a crucial region in the Earth's stratosphere that acts as a protective shield against harmful ultraviolet (UV) radiation from the sun. It is formed by a high concentration of ozone molecules, which absorb and block a significant portion of the UV rays. This protective barrier plays a vital role in safeguarding life on Earth by reducing the harmful effects of UV radiation, such as skin cancer, cataracts, and damage to ecosystems. The depletion of the Ozone layer, primarily caused by human activities releasing ozone-depleting substances, poses a significant environmental concern and has led to international efforts to mitigate further damage and promote its recovery.",
    "img": "https://cdn.britannica.com/66/89866-050-48693C5A/Dead-Sea.jpg"
  },
  {
    "id": 29,
    "topic": "The Great Lakes in North America contain about 21% of the world's surface fresh water.",
    "description": "The Great Lakes, located in North America, hold approximately 21% of the Earth's surface fresh water. Consisting of five interconnected lakes—Superior, Michigan, Huron, Erie, and Ontario—they form the largest group of freshwater lakes on the planet. These vast bodies of water are renowned for their ecological importance, providing habitat for diverse plant and animal species. The Great Lakes also play a significant role in transportation, recreation, and the economy of the surrounding regions. They are a vital water resource, supplying drinking water to millions of people and supporting various industries. The Great Lakes region is known for its scenic beauty and offers numerous recreational activities, making it a popular destination for boating, fishing, and other water-based adventures.",
    "img": "https://geology.com/maps/lakes/great-lakes/great-lakes.jpg"
  },
  {
    "id": 30,
    "topic": "The Alps in Europe are a famous example of a mountain range formed by the collision of tectonic plates",
    "description": "The Alps, situated in Europe, are a renowned mountain range that serves as a prominent illustration of tectonic plate collision. These majestic mountains were formed through the convergence of several tectonic plates over millions of years. The collision resulted in the uplift and folding of the Earth's crust, creating the impressive peaks and valleys that characterize the Alpine landscape. The Alps are renowned for their breathtaking beauty, attracting tourists and outdoor enthusiasts from around the world. They offer a wide range of recreational activities, including skiing, mountaineering, hiking, and scenic drives. Additionally, the Alps have a significant impact on the region's climate, hydrology, and biodiversity, making them a crucial ecological and cultural treasure of Europe.",
    "img": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/92/Tectonic_map_Mediterranean_EN.svg/350px-Tectonic_map_Mediterranean_EN.svg.png"
  },
  {
    "id": 31,
    "topic": "The Burgess Shale in Canada is renowned for its exceptional preservation of Cambrian period fossils.",
    "description": "The Burgess Shale, located in Canada, is celebrated for its remarkable preservation of fossils from the Cambrian period. This fossil site provides a unique glimpse into the early stages of animal evolution, offering a wealth of well-preserved and diverse organisms that lived over 500 million years ago. The exceptional preservation of soft tissues in the Burgess Shale fossils provides valuable insights into the anatomy, behavior, and ecological relationships of ancient marine life. The discoveries made in the Burgess Shale have greatly contributed to our understanding of the explosion of life during the Cambrian period and have helped scientists unravel the mysteries of early animal evolution. The site is considered a significant paleontological treasure and continues to be studied extensively by researchers from around the world.",
    "img": "https://cdn.mos.cms.futurecdn.net/FEyLB5hUQ7M5Yd8KQzjrwW-1200-80.jpg"
  },
  {
    "id": 32,
    "topic": "The Permian-Triassic extinction event, known as the Great Dying, was the most severe mass extinction in Earth's history.",
    "description": "The Permian-Triassic extinction event, also known as the Great Dying, is considered the most devastating mass extinction event in Earth's history. Taking place around 252 million years ago, it led to the disappearance of a vast number of plant and animal species. Over 90% of marine life and 70% of terrestrial species went extinct during this event. The causes are believed to be a combination of intense volcanic activity, global climate change, and environmental upheaval. The Great Dying dramatically reshaped the course of evolution and set the stage for the rise of new life forms on our planet.",
    "img": "https://earth.stanford.edu/sites/default/files/styles/wysiwyg_landscape_xl_1x/public/inline-images/187419_web.jpg?itok=zkyTDfNE"
  },
  {
    "id": 33,
    "topic": "Oceans cover approximately 71% of the Earth's surface.",
    "description": "Oceans, comprising around 71% of the Earth's surface, are vast bodies of saltwater that connect continents and shape the planet's geography. They are home to an incredible variety of ecosystems and support an abundance of life, ranging from microscopic organisms to magnificent marine creatures. Oceans influence weather patterns, store and release heat, and absorb carbon dioxide, playing a crucial role in regulating the Earth's climate. They also serve as a source of food, energy, and minerals, and offer endless opportunities for exploration and discovery. The oceans are a dynamic and essential part of our planet's interconnected systems, influencing life on land and contributing to the overall balance of the Earth.",
    "img": "https://images.slideplayer.com/41/11182031/slides/slide_2.jpg"
  }
]
